public/数据库系统原理笔记.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-10-24 六 13:16 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>&lrm;</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Evan Meek">
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org63d9309">数据库系统概述</a>
<ul>
<li><a href="#org4bef206">数据库的基本概念:</a></li>
<li><a href="#orgcafb0c6">数据库管理技术发展</a></li>
<li><a href="#orgc9aac0e">数据库系统的结构</a></li>
<li><a href="#org726c3d8">数据模型</a></li>
</ul>
</li>
<li><a href="#orga81d494">关系数据模型（重点）</a>
<ul>
<li><a href="#org57b93af">关系数据库的概述:</a></li>
<li><a href="#org4a1b4d8">关系数据库模型:</a></li>
<li><a href="#org46fd100">关系数据库的规范化理论(范式)</a></li>
</ul>
</li>
<li><a href="#org487c673">数据库设计</a>
<ul>
<li><a href="#orgbbd9ce3">数据库设计概述</a></li>
<li><a href="#org3ef33e1">数据库设计的基本步骤</a></li>
<li><a href="#org9160939">关系数据库设计方法</a></li>
</ul>
</li>
<li><a href="#org0abf0d3">SQL与关系数据库基本操作</a>
<ul>
<li><a href="#org6768e65">SQL概述</a></li>
<li><a href="#orge474d00">MySQL预备知识</a></li>
<li><a href="#org8d8e40c">数据定义</a></li>
<li><a href="#org15cfa34">GROUP BY 子句可以包含任意数目的列，使得其可对分组进行嵌套，为数据分组提供更加细致的控制。</a></li>
<li><a href="#org5c39cb9">如果在 GROUP BY 子句中嵌套了分组，那么将按 GROUP BY 子句中列的排列顺序的逆序方式依次进行汇总，</a></li>
<li><a href="#org5a66c92">GROUP BY 子句中列出的每个列都必须是检索列或有效的表达式，但不能是聚合函数。</a></li>
<li><a href="#orga474402">除聚合函数之外， SELECT 语句中的每个列都必须在 GROUP BY 子句中给出。</a></li>
<li><a href="#orgc532705">如果用于分组的列中含有 NULL 值，则 NULL 将作为一个单独的分组返回；</a></li>
<li><a href="#orgcb23813">WHERE 子句主要用于过滤数据行，而 HAVING 子句主要用于过滤分组，</a></li>
<li><a href="#org7a8656d">HAVING 子句中的条件可以包含聚合函数，而 WHERE 子句中则不可以。</a></li>
<li><a href="#orgb10b1cb">WHERE 子句会在数据分组前进行过滤， HAVING 子句则会在数据分组后进行过滤。因而，</a></li>
</ul>
</li>
<li><a href="#org51c13de">数据库编程</a>
<ul>
<li><a href="#org23bc90c">存储过程</a></li>
<li><a href="#org0213f5b">存储函数</a></li>
</ul>
</li>
<li><a href="#org15fd411">数据库安全与保护</a>
<ul>
<li><a href="#org2d787d8">数据库完整性</a></li>
<li><a href="#org98114a8">触发器</a></li>
<li><a href="#org0480c29">安全性与访问控制</a></li>
<li><a href="#org327c4c5">事物与并发处理</a></li>
</ul>
</li>
<li><a href="#orgf49ab10">数据库应用设计与开发实例(高校在线选课系统)</a>
<ul>
<li><a href="#orge2f544e">需求描述与分析(选择填空)</a></li>
<li><a href="#org8b824df">系统设计(解答实操)</a></li>
<li><a href="#org82e920d">系统实现(解答实操)</a></li>
<li><a href="#orgdbd2d3a">系统测试与维护(选择填空)</a></li>
</ul>
</li>
<li><a href="#orgc99a26e">数据库管理技术的发展</a>
<ul>
<li><a href="#orged1f131">数据库技术发展阶段概述(选择填空)</a></li>
<li><a href="#org4cbb913">数据库仓库与数据挖掘</a></li>
<li><a href="#org39542ce">大数据管理技术</a></li>
<li><a href="#org19d23bb">通过PHP编程语言编写相应的服务端代码,完成前台页面与后台数据的交互操作,</a></li>
<li><a href="#org8e9e5d4">PHP内置了许多函数,通过使用内置函数 mysql,PHP程序可以很好地与MYSQL数据库进行交互.</a></li>
<li><a href="#org530faa8">PHP操作MYSQL数据库的基本步骤如下:</a></li>
<li><a href="#org001d375">建立数据库连接的方法(mysql()函数的用法)</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org63d9309" class="outline-2">
<h2 id="org63d9309">数据库系统概述</h2>
<div class="outline-text-2" id="text-org63d9309">
</div>
<div id="outline-container-org4bef206" class="outline-3">
<h3 id="org4bef206">数据库的基本概念:</h3>
<div class="outline-text-3" id="text-org4bef206">
<p>
1&gt;数据(Data)
  1)含义:数据是描述事物的 符号记录 ,是指利用物理符号记录下来的,可以鉴别的信息;
  2)数据的语义(表头):数据是信息存在的一种形式,只有通过解释或处理的数据才能成为有用的信息;
</p>

<p>
2&gt;数据库
  1)含义:数据库(Database,DB)是指长期存储在计算机中的有组织的,可共享的数据的集合;
  2)原则:
	*1.数据库要按照一定的 数据模型 组织,描述和存储,
	*2.具有 较小的冗余度 ,较高的 数据独立性 , //不必要的多次重复存储(冗余度)
	*3.系统 易于扩展 ,并可以被 多个用户分享 ;
</p>

<p>
3)三个基本特点:
  *1.永久存储
  *2.有组织
  *3.可共享;
</p>

<p>
4)数据库定义(解答题)
   数据库是长期存储在计算机中有组织的可共享的数据集合,且数据库中的数据按一定的数据模型组织,
   描述和存储,具有较小的冗余度,较高的数据独立性,系统易于扩展,并可以被多个用户分享;
</p>

<p>
3&gt;数据库管理系统(DBMS))(Database Management System)
  1)含义:是专门用于 建立 和 管理 数据库 的一套软件,介于 应用程序 和 操作系统 之间;
	*DBMS 没有图形化界面(不是应用程序),也不是操作系统 如mysql;
  2)功能
	*1.数据定义 功能
	*2.数据操纵 功能
	*3.数据库的 运行管理 功能;
	*4.数据库的 建立 和 维护 功能;
	   *5.数据组织、存储 和 管理 功能;
	*6.其他功能;(与其他软件的 网络通信 功能,不同数据库管理系统之间 数据传输 及 相互访问 功能)。
</p>

<p>
3)数据库系统(DBS)的构成
   *1.数据库(DB);
   *2.数据库管理系统(DBMS)以及相关实用工具;
   *3.应用程序;
   *4.数据库管理员(DBA)(DataBase Administrator);
   *5.用户(程序员或数据库终端用户);
</p>

<p>
DBS构成示意图:
</p>

<p>
用户(程序员)     用户(数据库终端用户)
   ↘            ↙
	   应用程序
		  ↓
	数据库管理系统&#x2014;&gt;数据库管理员(DBA)
	   (DBMS)
		  ↓
	   数据库
		(DB)
</p>
</div>
</div>

<div id="outline-container-orgcafb0c6" class="outline-3">
<h3 id="orgcafb0c6">数据库管理技术发展</h3>
<div class="outline-text-3" id="text-orgcafb0c6">
<p>
*1数据的组织
  分为逻辑组织和物理组织两种，这二者可以相互独立的
  数据的逻辑组织是用户或应用程序所使用的数据结构形式，
  数据的物理组织是数据在物理存储设备上的结构形式。
</p>

<p>
*2.数据管理的任务
   就是进行数据收集、组织、控制、存储、选取、维护，实现在适当的时刻、
   以适当的形式、给适当的人、提供适当的数据,它是数据处理的中心问题;
   而数据处理则是指对各种数据进行收集、存储、加工和传播的一系列活动的总和。
</p>

<p>
*3.检索
   为了备用，需要将数据归类进行存储；为了向用户提供信息，
   存储的数据要能够方便地被选择提取，这称作检索。
</p>


<p>
1&gt;数据库管理技术的发展
  1)人工管理阶段
	 *1.数据不保存
	 *2.应用程序管理数据
	 *3.数据面向应用程序
</p>

<p>
2)文件系统阶段(将应用程序与数据隔离)
  含义:文件系统是将数据的逻辑结构和物理结构分离，由“存放方法”实现逻辑结构与物理结构之间的映射。
</p>

<p>
应用程序1       应用程序2 &#x2026; 应用程序n
		╲          │        ╱
</p>
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">文件系统</td>
</tr>
</tbody>
</table>
<p>
	╱          │        ╲
数据1         数据2 &#x2026;  数据n
</p>

<p>
*1.数据独立
	  *含义:数据定义与使用数据的应用程序分离称为数据独立
</p>

<p>
*分类:
  1)逻辑独立性:数据定义的修改,在一定范围内不会引起应用程序的修改,这种独立称为数据的逻辑独立;
</p>

<p>
2)物理独立性:当物理结构发生改变时,不会导致应用程序的修改,这称为数据的物理独立性;
</p>

<p>
*逻辑结构与物理结构相分离,物理数据独立性
  *2.优点:
	 具有数据可长期保存和专门管理的特点，它还提供了物理数据独立性，
	 使应用程序脱离数据物理结构,提高适用性,从而使编程人员不必关心数据的
	 物理存储细节,提高了生产效率.并通过数据的抽取，而使数据共享成为可能;
</p>

<p>
*3.缺点:
   但是在文件系统中不能实现数据的普通共享,只能实现文件级的共享，
   而不能数据项级实现数据的共享。文件的逻辑结构是根据它的应用而设计的，
   数据的逻辑结构与应用程序之间相互依赖。当不同应用程序使用的数据大部分相同时，
   还必须构造各自的文件，这样仍然还存在大量的数据冗余。
</p>

<p>
3)数据库系统阶段(选择填空)
   *1.数据的集成  (是数据库管理系统的主要目的)(将不同数据集中在一起来操作管理)
   *2.数据共享性高  (不只是同一数据可以被多个不同用户存取,还包含了并发共享);
   *3.数据冗余小  (并非所有的冗余都可以或者应该被消除)
   *4.数据一致性  (通过消除或控制数据冗余可以在一定范围内避免数据的不一致性,引起不一致的)
   *5.数据的独立性高 (数据定义与使用数据的应用程序分离)
   *6.实施统一管理与控制 (通过数据库保护实现)
   *7.减少应用程序开发与维护的工作  (表现在应用方面的优点)
</p>

<p>
4)数据库保护(安全完整控制恢复)
  数据库管理系统具有对数据的统一管理和控制功能;主要包括:
  *1.数据的安全性；
  *2.数据的完整性；(定义了属性,并将该属性值域定义完整)
  *3.并发控制；(两个事务同时存取一个数据,造成并发)
  *4.故障恢复。(恢复回故障发生前的状态)
</p>
</div>
</div>

<div id="outline-container-orgc9aac0e" class="outline-3">
<h3 id="orgc9aac0e">数据库系统的结构</h3>
<div class="outline-text-3" id="text-orgc9aac0e">
<p>
1&gt;数据库系统的结构分类(识记)
  1)从DBA(数据库管理员)的视角看:
	*1.内部系统结构:
	   1.采用三级模式(模式(数据库核心),内模式,外模式)
		 #1.模式:称概念模式或逻辑模式,是数据在逻辑上的视图,即概念视图;描述数据库中全部数据的整体逻辑结构
</p>

<p>
#2.外模式:
   也称子模式或用户模式,数据视图或用户视图(面向应用),
   它是数据库用户能够看见和使用的局部数据的逻辑结构和特征的描述,
   是与某一应用有关的数据的逻辑表示,所以外模式用来描述数据库的局部逻辑结构。
</p>

<p>
#3.内模式:也称为存储模式,是内部视图或存储视图(面向数据库).(物理存储),只有数据库管理员(DBA能见到)
</p>

<p>
三级模式示意图:
</p>

<p>
应用A    应用B     应用C    应用D    应用E
   \      /         |        \       /
	外模式1       外模式2       外模式3 (子模式或用户模式:数据视图或用户视图)
	   ↑____________↑___________↑
					↑
				   模式 (概念模式或逻辑模式:概念视图或逻辑视图)
					↑
				  内模式 (存储模式:内部视图或存储视图)
					↑
				  数据库
2.三级结构的两层映像与数据独立性
</p>

<p>
映像:就是一种对应规则,它指出映像双方是如何进行转换的.(双向)
</p>

<p>
#1.外模式/模式映像:保证了数据与程序的逻辑独立性.(逻辑&#x2013;&gt;外模式) (保持外模式不变,提高用户体验)
</p>

<p>
#2.模式/内模式映像:保证了数据与程序的物理独立性.(物理&#x2013;&gt;内模式)
   (因为内模式是唯一的,所以模式/内模式的映射也是唯一的)
</p>

<p>
#3.两层映像意义:
   两层映像保证了数据库中的数据具有较高的逻辑独立性和物理独立性,
   简化应用程序的开发,减少了维护应用程序的工作量;
</p>

<p>
*2.外部系统结构:
   #1.集中式结构,(将系统所有功能的处理工作都集中到中心结点终端上)
   #2.分布式结构,(将系统的功能都分布到各个终端机上)
   #3.并行结构;(并行处理各系统功能)
</p>

<p>
*3.简述常规文件系统与分步式文件系统(HDFS)的不同;
   分布式文件管理系统与常规文件系统不同的是,它以大粒度数据块的方式存储文件,从而减少元数据的数量,
   这些数据块则通过随机方式选择不同的节点并存储在各个地方;
</p>

<p>
2)从数据库应用的用户的视角
  *1.客户/服务器结构(client/Server,C/S)
	 客户/服务器结构中:
	 ("客户端","前台"或"表示层")主要完成与数据库使用者的交互任务;
	 ("服务器","后台"或"数据层")主要负责数据管理;
	 表示层&lt;&#x2014;&gt;数据层
	 #1.单机方式(数据层与数据层在一台机器上)
	 #2.网络方式(不在一台机器上))
</p>

<p>
*2.浏览器/服务器结构(Browser/Server,B/S) (减轻客户端工作负担)
   是一种基于Web应用的客户/服务器结构,也称为三层客户/服务器结构.
   三层:表示层,处理层(中间层),数据层.
   表示层&lt;-&#x2014;&gt;处理层&lt;-&#x2014;&gt;数据层
  (浏览器)     (.exe)   (对数据库操作)
</p>
</div>
</div>
