org/数据库系统原理笔记.org
** 数据模型
   1>数据模型(Data Model)
	 含义:是现实世界数据特征的抽象,描述的是数据的共性内容,它是模型化数据和信息的工具,
	      也是数据库系统的核心和基础;

   2>数据的特征
	  1)静态特征:
	    *1.数据的基本结构,
	    *2.数据间的联系,
	    *3.数据取值范围的约束

	  2)动态特征:
	    指对数据可以进行符合一定规则的操作;(增删改查)

   3>数据模型组成的三大要素:

	  1)数据结构:
	    描述的是系统静态特征,
	    即数据对象的数据类型,内容,属性以及数据对象之间的联系.(层次(树状),网状结构,关系);

	  2)数据操作:
	    描述的是系统的动态特征;
	    主要分为更新和检索两大类,增删改查

	  3)数据约束:
	    描述数据结构中数据间的语法和语义关联(正确性,相容性和有效性);

   4>数据模型的分类
	 简述概念模型,逻辑模型,物理模型的关系(既相互独立,有存在的联系)
	 *现实世界-(抽象)(数据库设计人员完成)
		 ->概念模型(抽象)(信息世界)-(组织,转换)(数据库设计工具协助人员完成)
		 ->逻辑模型和物理模型(机器世界)

	 1)概念层数据模型:
	   概念层是数据抽象级别的最高层,概念层数据模型,也称为数据的概念模型或信息模型,
	   这类模型主要用于数据库的设计阶段;(它用来描述现实世界的事物,与具体的计算机系统无关;)

	  *1.信息世界涉及的基本概念

		#1.实体(Entity):客观存在，并可相互区别的事物称为实体(实体可以是实际的事物,也可以是抽象的概念或联系)

		#2.属性(Attribute):实体所具有的某种特性称为实体的属性,一个实体可以由多个属性来描述;

		#3.码或键(Key):可唯一标识实体的属性集(具有唯一性的属性)

		#4.域(Domain):属性的取值范围

		#5.实体型(Entity Type):相同属性组成的实体必然具有共同的特征和性质

		#6.实体集(Entity Set):相同实体的集合称为实体集;

		#7.联系(Relationship):实体内部的联系通常是指实体各属性之间的联系,实体之间的联系是指不同实体之间的联系;

		#8.型(type):对一类属性的说明;

		#9.值(value):对一类属性具体赋值;

	  *2.E-R图(概念模型的表示方法)
	     Entity-Relationship(实体关系图)
		 #1.实体型:用矩形表示,矩形框内写明实体的名称;
	     #2.属性:用椭圆形表示,并用无向边将其与相应的实体连接起来;
	     #3.联系:用菱形表示,菱形框内写明联系的名称,并用无向边分别与有关实体连接起来,
		   同时在无向边旁标上联系的类型(1:1,1:N或M:N),如果一个联系具有属性,
		   则这些属性也要用无向边与该联系连接起来;

		   ○:属性; □实体; ◇联系; □实体  -无向边
		     姓名---职工---属于---单位

	  *3说明概念模型的表示方法(***解答题***)
		 概念模型表示方法是用E-R图来描述现实世界的概念模型,实体用矩形表示,属性用椭圆表示,联系用菱形表示;


	 2)逻辑层数据模型

	   *1.逻辑层是抽象级别的中间层,逻辑层数据模型,也称为数据的逻辑模型,任何DBMS都是基于逻辑数据模型.
		    (既要考虑用户又要考虑DBMS的实现)

	   *2.逻辑模型的类型

		  (1).层次模型:(树状)

			#1.是最早使用的一种数据模型;

			#2.有且仅有一个结点没有父结点,称作根结点;

			#3.其他结点有且只有一个父结点;

		  (2).网状模型(图)

			 #1.以网状结构表示实体与实体间的联系;

			 #2.允许结点有多于一个父结点;

			 #3可以有一个以上的结点没有父结点;

		   (3).关系模型(二维表格结构来表示实体间的联系);

			 #1.建立在严格的数学概念的基础上;

			 #2.概念单一;

			 #3.存储路径对用户透明,有更高的数据独立性,更好的安全保密性;

		   (4).面向对象模型
			  既是概念模型又是逻辑模型,表达力丰富,对象可复用,维护方便;

	 3)物理层数据模型
	   *1.物理层数据模型,也称为数据的物理模型,描述数据在存储介质上的组织结构,
	      是逻辑模型的物理实现,是数据库最底层的抽象;
	   *2.设计目标是提高数据库性能和有效利用存储空间;

	 *简述概念模型,逻辑模型,物理模型的关系(既相互独立,又存在的联系)
	  三个不同的数据模型之间既相互独立又存在着关联,
	  从现实世界到概念模型的转换是由数据库设计人员完成的;
	  从概念模型到逻辑模型的转换可以有数据库设计人员完成,也可以用数据库设计工具协助设计人员完成;
	  从逻辑模型到物理模型的转换主要由数据库管理系统完成的;

* 关系数据模型（重点）
** 关系数据库的概述:
   1>关系数据库的产生历史:
	 1)关系代数--->关系模型(1970年)
	 2)关系方法理论研究和软件系统的研究取得重大突破(20世纪70年代末)
	 3)出现了比较成熟的关系数据库管理技术,证实了关系数据库的优点,高级的非过程语言接口,较好的数据独立性;(1981年)
	 4)网络模型和层次模型与底层实现紧密结合,关系模型具有坚实理论基础成为主流数据模型;
	 *.关系数据库的优点:高级的非过程语言接口,较好的数据独立性

