public/数据库系统原理笔记.html

<div id="outline-container-org4a1b4d8" class="outline-3">
<h3 id="org4a1b4d8">关系数据库模型:</h3>
<div class="outline-text-3" id="text-org4a1b4d8">
<p>
1&gt;关系模型的组成要素(<b>**</b>)
  1)关系数据结构;
  2)关系操作集合;
  3)关系完整性约束;(表内各属性的值必须赋值)
</p>

<p>
2&gt;关系数据结构(简单应用)
  1)表(Table):是一个二维的数据结构,由表名,列及若干行数据组成也称关系;
  2)关系(relationship):
	一个关系逻辑上对应一张二维表,可以为每个关系取一个名称进行表示;
	(某种程度上关系等同于表,表是关系的呈现,表名唯一);
</p>

<p>
3)关系数据库中关系的三种类型:(<b><b><b>解答题</b></b></b>)
   #1.基本关系:又称基本表或基表,是实际存在数据库中的表,它是实际存储数据的逻辑表示 (实表)
   #2.查询表:依据某种条件查询后,得到的查询结果生成的表 (虚表)
   #3.视图表:是由基本表或其他视图表导出的表,不对应实际存储的数据;(虚表)
</p>

<p>
3&gt;列(Column)
  1)概念:也称为字段(Filed)或属性(Attribute);
  2)列名,字段名,属性名,数据类型相同,(属性(attribute)=列)
  3)在同一表中表名与字段名必须唯一,不能重复.但不同表中可以出现相同列名
  4)属性(列)的个数称为关系的元或度(表有8个属性=8元(度)关系)
  5)列的值称为属性值
  6)属性值取值范围称为值域
</p>

<p>
4&gt;行(Row)
  1)概念:也称为元组(Tuple)或记录(Record).表中的数据按行存储;
  2)分量(Component)具体的数据项:元组中的一个属性值;
</p>

<p>
5&gt;码或键(Key)
  1)概念:
	 属性(或属性组)的值都能用来唯一标识该关系的元组,
	 (属性或属性组的值能唯一标识出该表的该行 关系==表)
	 则称这些属性(或属性组)为该关系的码或键;
</p>

<p>
2)超码或超键(super key):
   在码中去除某个属性,它任然是这个关系的码;
   判断超码:
   #1.是不是码;
   #2.属性组中去掉一个码后的属性组是否是码;
</p>

<p>
3)候选码或候选键(Candidate key):
   在码中不能从中移除任何一个属性,否则它就不再是这个关系的码或键;
   候选码是最小的超码;(再减属性就不能称为码了)(候选码不一定是属性组)
   判断候选码:就是在属性组中移除任意一个属性,就不能标识出主对象
</p>

<p>
4)主属性(Primary attribute):
   包含在任何一个候选码中的属性称为主属性或码属性;
</p>

<p>
5)非主属性(Non Primary attribute):
   不再候选码中的属性;(不能唯一标识出)
   判断:是不是码-&gt;是不是候选码-&gt;如果都成立那候选码中的属性就是主属性
</p>

<p>
6)主码或主键(Primary Key):
   在若干个候选码中指定一个唯一标识关系的元组(行);[主观指定]
</p>

<p>
7)全码或全键(All Key):
   一个关系模式的所有属性集合是这个关系的主键或主码,这样的主键或主码称为全码或全键;
</p>

<p>
8)外码或外键(Foreign Key)(涉及两个表格)
   关系中的某个属性(或属性组)不是这个关系的主码或候选码,
   而是另一个关系的主码时,称该属性为这个关系的外键;
</p>

<p>
9)表的参照关系(Referencing Relation)和被参照关系(Referenced Relation)
   在关系数据结构中,参照关系也称为从关系(有外键),被参照关系称为主关系(外码是主键),
   被参照关系和参照关系是通过外码联系的,这种联系通常是一对多的关系;
</p>

<p>
*注
 #1.一个关系逻辑上对应一张二维表:关系==表;
 #2.属性是字段,而键是属性的值;
 #3.范围:属性或属性组&gt;键&gt;超键&gt;候选键(多个)&gt;主键(一个)&gt;全键&gt;外码
</p>

<p>
10)值域(Domain):
	表示属性的取值范围;
</p>

<p>
11)数据类型(Data Type)
	每个列都有相应的数据类型,它用于限制(或容许)该列中存储的数据;
</p>

<p>
12)关系模式与关系(Relation Schema):(<b><b>解答题</b></b>)
	同数据库模型一样,数据库也有型和值之分,在关系数据库中关系模式是型(Type),
	关系是值(Value),即关系模式是对关系的描述,关系模式是静态的,稳定的,
	关系是动态的,随时间不断变化的,这是因为关系操作在不断更新数据库中的数据;
</p>

<p>
13)关系数据库(Relation Database)
	关系数据库以关系模型作为数据的逻辑模型,并采用关系作为组织方式的一类数据库,
	其数据库操作建立在关系代数的基础上,在一个给定的应用领域中,所有关系的集合构成一个关系数据库;
</p>

<p>
14）.关系数据库对关系的限定/要求(重点和难点)
	 #1.每一个属性都是不可分解的(不允许表中有表)
	 #2.每一个关系仅仅只有一种关系模式;(存储的数据要对应表头)
	 #3.每一个关系模式中的属性必须命名,在同一个关系模式中属性名必须不同;(唯一)
	 #4.同一个关系中不允许出现候选码或候选键完全相同的元组;(不能有重复元祖(行))
	 #5.在关系中元组的顺序(即行序)是无关紧要的,可以任意交换;
	 #6.在关系中属性的顺序(即列序)是无关紧要的,可以任意交换;
</p>

<p>
*1.简述主属性和非主属性的区别
   关系中包含在任何一个候选吗中的属性称为主属性或码属性,不包含在任何一个候选键中的属性称为非主属性;
</p>

<p>
*2.简述Mysql中候选键与主键之间的区别
   #1.一个表中只能创造一个主键,但可以定义若干个候选键.
   #2.定义主键约束时,系统会自动产生Primary key 索引,而定义候选键约束时,系统自动产生UNIQUE索引.
</p>

<p>
*3.简述外键声名的两种方式
   #1.在表中某个列的属性定义后直接加上"reference<sub>definition</sub>"语法项.(主键就加PRIMARY KEY)
   #2.定义主键约束时,系统会自动产生Primary Key索引,而定义候选键约束时,系统自动产生UNIQUE索引;
</p>



<p>
6&gt;基本的操作关系(选择,投影,并,差,笛卡尔积)
  关系操作的特点:集合的操作方式(一次一集合)
  关系模型中常用的关系操作包括两大部分:
</p>
<ol class="org-ol">
<li>查询(Query)操作</li>
<li>插入(insert),删除(Delete),更新(update)操作;</li>
</ol>
<p>
1)查询(Query)(代数五种基本操作)
	#1.选择
</p>

<p>
#2.投影
</p>

<p>
#3.并(去重且列数相同)
  假设有两个关系R1和R2,R1和R2的并运算产生一个新关系R3,
  R3是由属于关系R1或关系R2的所有不同的元祖组成的,记为R3=R1UR2
</p>


<p>
#4.差(R1-R2就是把R1表中与R2表中相同的数据去掉)
  假设有两个关系R1和R2，R1和R2的差运算产生一个新关系R3。R3是由属于关系R1，
  但不属于R2的元组组成，记为R3=R1-R2。即设关系R1和R2具有相同的关系模式，
  R1和R2的差是由属于R1但不属于R2的元组构成的集合。
</p>

<p>
#5.笛卡尔积
  假设有两个关系R1和R2,且R1为m个元组,R2为n个元组, R1的元数为r，R2的元数为s，
  R1和R2的笛卡尔积产生一个新关系R3,记做R3=R1*R2,则R3是由R1和R2的所有元组连接而成的
  具有(m*n)个元组和（r+s）和属性列组成;
</p>


<p>
2)关系数据语言的分类(<b><b><b>解答题</b></b></b>)
	<b>1.关系代数语言(</b>)
	*2.关系演算语言(元组关系演算,域关系演算)
	*3.兼具两者双重特点的语言(SQL语言)
	  共同特点:语言具备完备的表达能力,是非过程化的集合操作语言,
			   功能强,能够独立使用也可以嵌入高级语言中使用;
  *关系语言的特点:
   高度非过程化,即:用户不必请求数据库管理员为其建立特殊的存储路径,
   存储路径的选择由DBMS的优化机制来完成;
   用户也不必求助于循环和递归来完成数据的重复操作;
</p>

<p>
3)关系代数的运算符
  *1关系集合运算归类
	 1)传统关系运算(并,差,交,笛卡尔积);
	 2)基本的关系操作(选择,投影,并,差,笛卡尔积);
	 3)专门的关系运算(选择,投影,连接,除)
</p>

<p>
*2.任何一种操作都包含三大要素
   #1.操作对象
</p>

<p>
#2.操作符(集合运算符和关系运算符,比较操作符和逻辑操作符(辅助))
   以下是传统的集合运算:
   并(R1 ∪ R2);两个关系必须有相同的属性个数(去重合并)
   差(R1 - R2);两个关系必须有相同的属性个数(去重剩下R1表中仅有的属性)
   交(R1 ∩ R2);两个关系必须有相同的属性个数(取重)
   笛卡尔积(CARTESIAN PRODUCT)(R1 x R2) (矩阵操作)(元祖数 m*n,属性数 s+r)
</p>

<p>
#3.操作结果
</p>

<p>
4)专门的关系运算(选择,投影,连接,除)
</p>

<p>
*1.选择(SELECT)
   σ f(R)  SELECT 表名 WHERE 条件(如性别="男")
   水平分解出表中符合条件的行(选行)(水平分解);
</p>

<p>
示例:
选择关系表S1中性别为男的元祖
σ性别="男"(S1)
</p>

<p>
关系表S1
学号(SNO)   姓名(SNAME)   性别(SSEX)
 01          钟义          男
 02          海燕          女
 03          赵越          男
</p>

<p>
学号(SNO)   姓名(SNAME)   性别(SSEX)
 01          钟义          男
 03          赵越          男
</p>

<p>
*2.投影(PROJECTION)
   πR(A) :A为属性
   π(属性名1,属性名2,&#x2026;属性名n) (表名)
   将表格中的对应属性摘除建成新表作为原表的投影;(选列)(垂直分解)
</p>

<p>
示例:投影出表S1中的学号和姓名
Π 学号,姓名(S1)
学号(SNO)   姓名(SNAME)
 01          钟义
 02          海燕
 03          赵越
</p>

<p>
*3.连接(JOIN),也称θ连接: JOIN 表名1 AND 表名2 Where 条件
   R∞S
   等值连接: R.B=S.B
   其他自然连接:特殊的等值连接
</p>

<p>
表R            表S
A   B   C      B   E
a1  b1  5      b1  3
a1  b2  6      b2  7
a2  b3  8      b2  10
a2  b4  12     b3  2
			   b5  2
示例:根据上图,连接表R和表S;
 #1 笛卡尔积 并做 等值连接 (只留属性值相等的)
   A  R.B  C  S.B   E
   a1  b1  5   b1   3
   a1  b2  6   b2   7
   a1  b2  6   b2   10
   a2  b3  8   b3   2
</p>

<p>
#2去掉重复列(自然连接)(利用了投影)
	A   B   C   E
	a1  b1  5   3
	a1  b2  6   7
	a1  b2  6   10
	a2  b3  8   2
</p>

<p>
综合实例:
设有两个关系:学生关系S(学号,姓名,年龄,性别)和选课关系SC(学号,课号,成绩),
试用关系代数表达式检索没有选修B5课程的学生姓名;
π姓名(S)-π姓名(σ课号='B5'(S∞SC))
</p>


<p>
*4.除(DIVISION): 表R÷表S
  *1投影:将两个表中不同的列(字段)投影出表πAB
  *2笛卡尔积:表S×表πAB得出表S×πAB
  *3全部相同:表S×πAB与表R比较得出完全相同的表Q
  *4得出除表:表Q中的列去除表S中的列得出表R÷S表
</p>

<p>
*关系代数表达式是先运算()里的,在运算括号外的;
  Π SNO,SCORE(σAGE&gt;22(SC))
  含义:*1从表SC中筛选出AGE&gt;22的行,
	   *2在这些行中投影出SNO和SCORE列建出原表的投影
</p>

<p>
*其中一元专门关系操作包括投影和选择；二元专门关系操作包括连接和除。
</p>


<p>
7&gt;关系的完整性约束
  1)数据完整性约束(解答题)
	*1.数据库的数据完整性是指数据的正确性,相容性,一致性.其中包含两个方面:
	   #1.与现实世界中应用需求的数据的正确性,相容性和一致性,
	   #2.数据库内数据之间的正确性,相容性和一致性.
		  正确性:主键唯一,各属性值符合值域
		  相容性和一致性:两个表有参照关系,参照表的外键值要对应被参照表的主键值或为NULL;
</p>

<p>
*2.数据完整性约束是为 了防止数据库中存在不符合语义的数据,为了维护数据的完整性.
   DBMS必须提供一种机制来检查数据库中的数据,以判断其是否满足语义规定的条件,
   这些加在数据库数据之上的语义约束条件就是数据完整性约束;
</p>

<p>
2)关系完整性约束具体定义
   *1.实体完整性约束(Entity Integrity Constraint)关系&#x2013;&gt;实体集
	  主键 的组成 不能为空 ,主键中的 主属性 不能是空值NULL;
</p>

<p>
*2.参照完整性约束(Referential Integrity Constraint)
   就是定义外码和主码之间的引用规则;是对关系间引用数据的一种限制,
   具体来说就是若属性F是关系R的外键, 它与基本关系S的主键K相对应,
   则对应R中每个元祖在F上的值只允许两种可能,要么取空值(NULL),
   要么等于S中某个元祖的K值,
</p>

<p>
(要么外码等于被参照表主码中某个元组的主码值,要么为空值(NULL))
*.参照表的外键值与被参照表的主键值要对应(外键=被参照表的主键值或NULL)
</p>

<p>
*3.用户完整性约束(User-defined Integrity Constraint )
   #1.域的完整性约束(针对某一应用环境的完整性约束)
   #2.其他;
</p>

<p>
3)关系完整性约束的检验(增,删,改)
   *1.执行插入操作
	  #1.检查实体完整性约束-&gt;检查表中主键是否为空
	  #2.检查参照完整性约束-&gt;检查要插入的外键是否对应被参照表主键值(向参照关系插入)
	  #3.检查用户定义完整性约束;
</p>

<p>
*2.执行删除操作(是否被引用)
   一般只需要对被参照关系检查参照完整性操作;
   也就是要被删除的操作是否被其他表格所引用;(具有参照关系)
</p>

<p>
*3.执行更新操作
   上述两种情况的综合;
</p>
</div>
</div>
