public/数据库系统原理笔记.html

<div id="outline-container-org46fd100" class="outline-3">
<h3 id="org46fd100">关系数据库的规范化理论(范式)</h3>
<div class="outline-text-3" id="text-org46fd100">
<p>
1&gt;关系模式中可能存在的冗余和异常问题(简单应用)
</p>

<p>
1)数据冗余:指同一数据被反复存储的情况;
</p>

<p>
2)更新异常:数据冗余造成的,(数据重复会只改其中一条,其他没改)
</p>

<p>
3)插入操作异常:
</p>

<p>
4)删除异常:关键字的删除异常使相关表没有意义;
</p>

<p>
2&gt;函数依赖和关键字
  1)概念:f: A-&gt;B, y=f(x)
</p>

<p>
   设R为任一给定关系,如果对R中属性X的每一个值,R中的属性Y只有唯一一值与之对应,
   则称X函数决定Y或称Y函数依赖于X,记做X-&gt;Y,其中X称为决定因素;(如学号X-&gt;姓名Y)
   反之Y-/-&gt;X
2)分类
   *1.完全函数依赖(解答题)
	   设R为任一给定关系,X,Y为其属性集,若X-&gt;Y,且对X中的任何真子集X',
	   都有X'-/-&gt;Y,则称Y完全函数依赖于X;
</p>

<p>
示例:
学生课程表SC
SNO(学号)   CNO(课程号)   CTITLE(课程名)  GRADE(成绩)
 01          11           数据库原理       80
 01          12           数据结构导论     90
 02          11           数据库原理       95
 02          12           数据结构导论     85
</p>

<p>
SC( SNO, CNO,  CTITLE, GRADE)
	学号 课程号  课程名  成绩
其中(SNO,CNO)-&gt;GRADE; 且SNO-<i>-&gt;GRADE; CNO-</i>-&gt;GRADE;
则GRADE完全依赖于(SNO,CNO);
</p>

<p>
*2.部分函数依赖
	设R为任一给定关系,X,Y为其属性集,若X-&gt;Y,且对X中
	存在一个真子集X'满足X'-&gt;Y,则称Y部分函数依赖于X.
</p>

<p>
示例:
学生表ST
SNO(学号)   SNAME(姓名)   SSEX(性别)
 01          钟义          男
 02          海燕          女
 03          赵月          男
</p>

<p>
ST(SNO,SNAME,SSEX)
其中(SNO,SNAME)-&gt;SSEX,且 SNO-&gt;SSEX;SNAME-&gt;SSEX;
则SSEX部分依赖于(SNO,SNAME);
</p>

<p>
*3.传递函数依赖
	设R为任一给定关系,X,Y,Z为其不同属性子集,若X-&gt;Y,Y-/-&gt;X,Y-&gt;Z,则有X-&gt;Z,
	则称Z传递函数依赖于X.
</p>

<p>
示例:
图书表BOOKS
BNO(书号)   PNAME(出版社名)   PADRESS(出版社地址)
 01         北京大学出版社        北京
 02         复旦大学出版社        上海
 03         北京大学出版社        北京
</p>

<p>
BOOKS(BNO,PNAME,PADRESS)
其中 BNO-&gt;PNAME, PNAME-&gt;PADRESS;
则有BNO-&gt;PADRESS,称PADRESS传递函数依赖于BNO;
</p>

<p>
*真子集:如果A包含于B,且A不等于B,就说集合A是集合B的真子集(去除本身的子集)。
</p>

<p>
3)关键字
	 设R为任一给定关系,U为其所含的全部属性集合,X为U的子集,若有完全依赖函数X-&gt;U,
	 则X为R的一个候选关键字(X是候选码)
	 SC( SNO, CNO,  CTITLE, GRADE)    U{SNO, CNO,  CTITLE, GRADE}//U全部属性集合
	 (SNO,CNO)-&gt;CTITLE, (SNO,CNO)-&gt;GRADE   //(SNO,CNO)为候选关键字
</p>

<p>
3&gt;范式与规范化过程(综合应用)
 一个 低一级 范式的关系通过 模式分解 可以转换为若干个 高一级范式 的关系模式的集合,
 这种过程就叫 规范化
</p>

<p>
1)第一范式(表中属性不能再分)(1NF)
  设R为任一给定关系,如果R中每个 列与行的交点处 的取值,都是 不可再分 的 基本元素,
  则称R为第一范式的,简称1NF
  *缺点:会造成冗余高-&gt;更新异常,插入操作异常,删除异常
</p>

<p>
2)第二范式(2NF):
  设R为任一给定关系,若R为1NF,若R中,且其所有 非主属性 都 完全函数依赖 候选关键字(候选码),
  则称R为第二范式的,简称2NF;
</p>

<p>
3)第三范式(3NF):
  设R为任一给定关系,若R为2NF,且其每一个 非主属性 都不 传递函数依赖 候选关键字,
  则称R为第三范式的,简称3NF;
</p>

<p>
4)巴斯范式(BCNF)
 设R为任一给定关系,X,Y为其属性集,F为其函数依赖集,若R为3NF且其F中所有函数依赖
 X-&gt;Y(Y属于X)中的X必须包含候选关键字,则R为BCNF;
</p>

<p>
4&gt;低级范式向高级范式转换方法
  *1.由不符合范式规范的关系表,符合第一范式(1NF)
	 规范方法:拆分行和列
	 #1.使每列属性不可再分,属性值只代表一个属性(课程+讲师)-&gt;(课程名) (讲师)
	 #2.使每行分量不可再分,一个分量包括多行元祖-&gt;一个分量只对应一个元祖(行)
</p>

<p>
示例:
			学生选课表SC
SNO    SNAME   CUS<sub>INFO</sub>      IPLACE  GRADE
901001 C01    操作系统(王中)    东     70
901002 C01    操作系统(王中)    东     78
	   C02    数据库(高国)      东     85
	   C03    数据结构(王中)    东     80
			   ↓1NF
SNO    CNO  CTITLE    INAME  IPLACE GRADE
901001 C01  操作系统   王中    东      70
901002 C01  操作系统   王中    东      78
901002 C02  数据库     高国    北      85
901002 C03  数据结构   王中    东      80
</p>

<p>
*2.1NF-&gt;2NF
   规范方法:拆分表
   #1.找到候选关键字,看其余的属性是否完全依赖候选关键字;
   #2.是的,与候选关键字一同抄下来形成一个表格;
   #3.不是的,查下来,形成第二个表格,并且将候选关键字里能唯一
	  决定表格2的属性组抄在第一列;
   示例:
   SC的候选关键字为(SNO,CNO),将其变为第二范式
   解题思路:
   除GRADE外,CTITLE,INAME,IPLACE,都可以有CNO确定,所以将表SC
   拆分为表一(SNO,CNO,GRADE)和表二(CNO,CTITLE,INAME,IPLACE);
</p>

<p>
				   学生选课表SC(1NF)
		SNO    CNO  CTITLE    INAME  IPLACE GRADE
		901001 C01  操作系统   王中    东     70
		901002 C01  操作系统   王中    东     78
		901002 C02  数据库     高国    北     85
		901002 C03  数据结构   王中    东     80
						↓2NF
		  表一                        表二
SNO     CNO   GRADE   |   CNO   CTITLE   INAME  IPLACE
901001  C01    70     |   C01   操作系统  王中   东
901002  C01    78     |   C02   数据库    高国   北
901002  C02    85     |   C03   数据结构  王中   东
901002  C03    80     |
</p>

<p>
*3.2NF-&gt;3NF
   规范方法:拆分表
   #1.找到表中的传递依赖函数关系的三个属性组,设为x,y,z
   #2.将这三个属性组拆成二个表格,表一为x,y 表二为y,z
  示例:
  表TC的候选关键字为CNO,使表TC符合3NF;
   解题思路:CNO-&gt;CTITLE,CTITLE-<i>-&gt;CNO,CTITLE-&gt;INAME,
		   CNO-&gt;INAME,INAME-</i>-&gt;CNO,INAME-&gt;IPLACE,
		  所以IPLACE传递函数依赖于CNO,
		  拆分:没有传递函数依赖的表(CNO,CTITLE)
			   有传递函数依赖的表(CTITLE  INAME)
			   有传递函数依赖的表(INAME  IPLACE)
</p>

<p>
		教师授课表TC
CNO   CTITLE   INAME  IPLACE
C01   操作系统  王中   东
C02   数据库    高国   北
C03   数据结构  王中   东
</p>

<p>
				  ↓3NF
	表1                 表2               表3
CNO   CTITLE   |   CTITLE  INAME  |  INAME  IPLACE
C01   操作系统      操作系统  王中     王中   东
C02   数据库        数据库    高国     高国   北
C03   数据结构  |   数据结构  王中  |
</p>

<p>
*4.3NF-&gt;BCNF
   规范方法:
   列出表格中的所有函数依赖关系,每个关系拆出一个表
   SNO CTITLE INAME           SNO INAME        INAME CTITLE
   S01  英语   王华            S01 王华          王华  英语
   S01  数学   沈飞   BCNF     S01 沈飞          沈飞  数学
   S02  物理   高俊  &#x2013;&#x2014;→    S02 高俊    和    高俊  物理
   S03  语文   袁晓            S03 袁晓          袁晓  语文
   S04  英语   王华            S04 王华
</p>
</div>
</div>
</div>

<div id="outline-container-org487c673" class="outline-2">
<h2 id="org487c673">数据库设计</h2>
<div class="outline-text-2" id="text-org487c673">
</div>
<div id="outline-container-orgbbd9ce3" class="outline-3">
<h3 id="orgbbd9ce3">数据库设计概述</h3>
<div class="outline-text-3" id="text-orgbbd9ce3">
<p>
1&gt;数据库的生命周期(选择,填空和解答)
  *.从数据库演变过程的角度来看,数据库的生命周期可分为两个阶段:
</p>

<p>
	 数据库 分析 与 设计 阶段      和    数据库 实现 和 操作 阶段
	 /      |     |     \               /         |        \
需求分析 概念设计 逻辑设计 物理设计      实现     操作与监督   修改与调整
</p>

<p>
1)数据库分析与设计阶段
  #1.需求分析
  #2.概念设计
  #3.逻辑设计
  #4.物理设计
</p>

<p>
2)数据库实现与操作阶段
  #1.实现
  #2.操作与监督
  #3.修改与调整
</p>

<p>
2&gt;数据库设计的目标(解答题)
</p>
<ol class="org-ol">
<li>满足应用功能需求 (存取删改)(增删改查)</li>
<li>良好的数据库性能 (填空解答题)
主要是指对数据的 高效率存取 和 空间的节省，
并具有良好的数据 共享性、完整性、一致性 及 安全保密性。</li>
</ol>

<p>
3&gt;数据库设计的内容
  数据库设计的特点是 结构设计 与 行为设计 分离。
</p>

<p>
1)数据库 结构设计(静态)
  *1.概念:
	 是针对给定的应用环境进行数据库的 模式 或 子模式 的设计，
	 包括数据库的 概念结构设计、逻辑结构设计 和 物理结构设计。
	 模式定义并给出各应用程序共享的结构,结构设计是 静态的，
	 一经形成通常不会改变。
</p>

<p>
*2.分类
   #1.概念结构设计
   #2.逻辑结构设计
	  #3.物理结构设计
</p>

<p>
2)数据库 行为设计(动态操作)
  *1.概念:
	 是确定数据库用户的 行为 和 动作，而用户的行为和动作
	 是对数据库的操作，它们通常是通过应用程序来实现的。
	 行为设计是动态的。
</p>

<p>
*2.分类
   #1.功能设计
   #2.事务设计
   #3.程序设计
</p>

<p>
数据库设计分类示意图:
		 ╭
</p>
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">╭#1.概念结构设计</td>
</tr>
</tbody>
</table>
<p>
		  │ 结构设计&lt; #2.逻辑结构设计
		  │         ╰#3.物理结构设计
		  │
数据库设计 │         ╭#1.功能设计
		  │ 行为设计&lt; #2.事务设计
		  │         ╰#3.程序设计
		  ╰
</p>

<p>
4&gt;数据库设计的方法(识记)
  1)直观设计法(最原始的数据库设计方法)
</p>

<p>
2)规范设计法
  #1.新奥尔良设计方法:需求分析,概念结构设计,逻辑结构设计,物理结构设计
  #2.基于E-R模型的数据库设计方法
</p>

<p>
╭         ╭属性域冲突;
│ 属性冲突&lt;
│         ╰属性取值单位冲突;
</p>
<table>


<tbody>
<tr>
</tr>
</tbody>
</table>
<p>
			│         ╭同名异义
各局部E-R图 &lt;  命名冲突&lt;
之间的冲突   |         ╰异名同义
</p>
<table>


<tbody>
<tr>
</tr>
</tbody>

<tr>
<td class="org-left">╭同一对象在一个局部E-R图中作为实体,而在另一个局部E-R图中作为属性;</td>
</tr>

<tr>
<td class="org-left">结构冲突&lt; 同一实体在不同 E-R图中属性个数和类型不同</td>
</tr>
</tbody>
</table>
<p>
╰          ╰实体间联系在不同的E-R图中是不同的类型;
</p>


<p>
#3.基于第三范式的设计方法,是一类结构化设计方法
</p>

<p>
3)计算机辅助设计法(在数据库设计过程中，以领域专家的知识或经验为主导，模拟某一规范化设计的方法，
  通常通过人机交互的方式来完成设计的某些过程。)
</p>

<p>
  5&gt;数据库设计过程(识记)
								  ╭ #1.确定数据范围(支持哪些应用)
								  │ #2.分析数据应用过程:
					  *1.需求分析 &lt;
								  │ #3.收集与分析数据
								  ╰ #4.编写需求分析报告
					 ↙         ↘
   #1概念结构设计╮                       ╭#1.功能设计
*2.#2逻辑结构设计-&gt;结构设计       行为设计&lt;-#2.事务设计
   #3物理结构设计╯  (静态)        (动态)  ╰#3.程序设计
					 ↘         ↙
								╭#1.加载数据库数据
				  *3.数据库实施 &lt; #2.应用程序设计
						 ↓      ╰#3.数据库试运行
						 ↓
				 *4.数据库运行与维护-&#x2014;&gt;系统维护中最困难的工作是数据库重组与重构
</p>
</div>
</div>
