public/数据库系统原理笔记.html

<div id="outline-container-org3ef33e1" class="outline-3">
<h3 id="org3ef33e1">数据库设计的基本步骤</h3>
<div class="outline-text-3" id="text-org3ef33e1">
<p>
1&gt;需求分析(领会)
  1)目标:(解答题)
	是了解与分析用户的信息及应用处理的要求,
	并将结果按一定的格式整理而形成的需求分析报告;
	*需求分析报告是后续概念设计,逻辑设计,物理设计,数据库建立与维护的依据;
</p>

<p>
2)分析过程:
		   ╭#1.确定数据范围
		   │#2.分析数据应用过程
  需求分析 &lt;
		   │#3.收集与分析数据
		   ╰#4.编写需求分析报告
</p>

<p>
1.确定数据范围(是需求分析的第一项工作)
  *1.有效的利用计算机设备及数据库系统的潜在能力;
  *2.提高数据库的应变能力;
  *3.避免应用过程中对数据库做太多或太大的修改;
  *4.延长数据库的生命周期;
</p>

<p>
2.分析数据应用过程(解答题)
  *1.用到那些数据;
  *2.数据使用的顺序;
  *3.对数据作何处理和处理的策略以及结果;
  *为了了解并分析数据与数据处理间的关系
  *应用过程分析结果是数据库结构设计的重要依据
</p>

<p>
3.收集与分析数据
				╭#1.静态结构:不施加应用操作于其上时数据的原始状态;
  收集与分析数据 &lt;#2.动态结构:将应用操作施加于数据之上后数据的状况;
				╰#4.数据约束:使用数据时的特殊要求;
</p>

<p>
*1.数据分类表&#x2014;用于数据的总体描述(静态结构)
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">数据ID</td>
<td class="org-left">数据名</td>
<td class="org-left">用途</td>
<td class="org-left">主人</td>
<td class="org-left">用户</td>
<td class="org-left">来源</td>
<td class="org-left">去向</td>
<td class="org-left">存档时间</td>
<td class="org-left">数据量</td>
</tr>
</tbody>
</table>

<p>
*2.数据元素表&#x2014;指通常意义下的数据项或属性(静态结构)
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">数据ID</td>
<td class="org-left">数据元素ID</td>
<td class="org-left">元素名</td>
<td class="org-left">意义</td>
<td class="org-left">类型</td>
<td class="org-left">长度</td>
<td class="org-left">算法</td>
<td class="org-left">备注</td>
</tr>
</tbody>
</table>

<p>
*3.数据任务表&#x2014;一个任务指为完成某一特定处理功能的相对独立的操作序列;(动态结构)
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">任务ID</td>
<td class="org-left">名称</td>
<td class="org-left">功能</td>
<td class="org-left">类型</td>
<td class="org-left">主人</td>
<td class="org-left">用户</td>
<td class="org-left">执行日期</td>
<td class="org-left">频率</td>
<td class="org-left">操作过程</td>
<td class="org-left">备注</td>
</tr>
</tbody>
</table>

<p>
*4.数据特征操作表&#x2013;用于描述任务和数据之间的关系,它包括不同任务对数据执行不同操作的频率;(动态结构)
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">任务ID</td>
<td class="org-left">数据ID</td>
<td class="org-left">建立</td>
<td class="org-left">查询</td>
<td class="org-left">插入</td>
<td class="org-left">修改</td>
<td class="org-left">删除</td>
<td class="org-left">数据量</td>
</tr>
</tbody>
</table>

<p>
*5.数据约束
   #1.数据的安全保密性;
   #2.数据的完整性;
   #3.响应时间;
   #4.数据恢复;
</p>

<p>
*数据收集与分析的任务:
 了解并分析数据的组成格式及操作特征,每个数据元素的语义及关系等,并将它们收集起来整理归档;
</p>

<p>
4.编写需求分析报告:
  *1.数据库的应用功能目标;
  *2.标明不同用户视图范围;
  *3.应用处理过程需求说明:
	  ╭#1.数据流程图;
</p>
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">#2.任务分类表;</td>
</tr>
</tbody>
</table>
<p>
包括&lt;
</p>
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">#3.数据操作特征表;</td>
</tr>
</tbody>
</table>
<p>
╰#4.操作过程说明书;
</p>

<p>
*4.数据字典,
   是数据库系统中存储三级结构定义的数据库,通常指的是数据库系统中各类数据详细描述的集合,
   功能是存储和检索各种数据描述,即元数据, 通常包括以下数据:
</p>

<p>
		   ╭#1.数据分类表;
   数据字典&lt; #2.数据元素表;
		   ╰#3.各类原始资料;
*5.数据量;
*6.数据约束;
</p>

<p>
2&gt;概念结构设计(领会)(E-R图)
  概念结构设计的常用方法
  有实体分析法和属性综合法两种，它们也分别称为自顶向下法和自底向上法。
</p>

<p>
*概念模型(自顶向下,逐步求精)
1)顶层设计-&gt;中层设计-&gt;底层设计
2)独立于任何软件与硬件,主要目标:最大限度的满足应用需求;
3)任务:在需求分析中产生的需求分析报告的基础上,按特定的方法设计满足应用需求的用户信息结构;
</p>

<p>
3&gt;逻辑结构设计(领会)(关系模型)
  1)层次模型&#x2013;&gt;网状模型&#x2013;&gt;关系模型&#x2013;&gt;面向对象模型
  2)概念设计-&gt;模型转换-&gt;子模式设计/应用程序设计说明-&gt;设计评价-&gt;物理设计
</p>

<p>
4&gt;物理设计(领会)(存储)
  具体任务主要是确定数据库在存储设备上的存储结构及存取方法,
  因DBMS的不同还可能包括建立索引和聚集,以及物理块大小,缓冲区个数和大小,数据压缩的选择等;
</p>

<p>
5&gt;数据库实施
 1)加载数据:收集,分类,整理校验,输入等;
</p>

<p>
2)应用程序设计
  具有较高稳定性,并具有试运行的数据基础,也具备了应用程序编制与调试的必要条件.
  这样编写的应用程序具有较高的稳定性和实用性.
</p>

<p>
3)数据库试运行
  #1.有利于工作人员掌握并熟悉系统;
  #2.有利于正式运行时避免人为的操作不当等损害;
</p>

<p>
6&gt;数据库运行与维护
  1)系统维护中最困难的工作是数据库的重组与重构;
  2)目的:保证数据库的正常运行
</p>
</div>
</div>

<div id="outline-container-org9160939" class="outline-3">
<h3 id="org9160939">关系数据库设计方法</h3>
<div class="outline-text-3" id="text-org9160939">
<p>
1&gt;关系数据库设计过程与各级模式(识记)
  应用要求-&gt;概念模式-&gt;逻辑模式(外模式)-&gt;内模式(物理模式)
</p>

<p>
                          ╭#1.实体分析法(自顶向下法);
		          概念设计&lt; #2.属性综合法(自底向上法);
                     ↓ 	  ╰*概念模型(自顶向下,逐步求精);
-------------&#x2013;&#x2014;逻辑设计---------------------------------------------------------------------&#x2013;&#x2014;
</p>

<p>
		          模型转换 --&#x2013;&#x2014;将概念模型等价转换为特定DBMS支持的关系模型,网状模型或层次模型;
抽取或导出   ╮     ↓      ↓
模式的子集,  │     ↓      ↓
以构造不同用户&gt;子模式设计  应用程序设计说明&#x2014;为可实际运行的应用程序设计提供依据与指导,并作为设计评价的基础;
使用的局部   │       ↓    ↓
数据逻辑结构 ╯       设计评价----&#x2013;&#x2014;分析并检验模式及子模式的正确性与合理性;
</p>

<hr>
<p>
   ↓    ╭任务:确定数据库在存储设备上的存储结构及存取方法
物理设计&lt;
		╰因DBMS的不同还可能包括建立索引和聚集,以及物理块大小,缓冲区个数和大小,数据压缩的选择;
</p>


<p>
2&gt;概念结构设计方法(综合应用)
  1)E-R图的表示方法
   #1.系(□)-隶属(◇)-系主任(□) 1:1
   #2.班级(□)-包含(◇)-学生(□) 1:N
   #3.学生(□)-选课(◇)-课程(□) N:M
   #4.供应商(□)-供应(◇)-项目(□)-零件(□) M:N:P
   #5.职工(□)-领导(◇) 1:N(单个实体的1对多联系)
</p>

<p>
2)局部信息结构设计
 *1.定义:根据需求分析报告中标明的不同用户视图范围所建立的满足该范围内用户需求的信息结构，
   称为局部信息结构。
</p>

<p>
<b>2.局部信息结构设计的步骤(<b><b>*解答题</b></b></b>)
╭ #1.确定局部范围:
</p>
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">局部范围的主要依据需求分析报告中标明的用户视图范围来确定,往往与子模式范围相对应</td>
</tr>
<tbody>
<tr>
</tr>
</tbody>

<tr>
<td class="org-left">#2.选择实体:</td>
</tr>

<tr>
<td class="org-left">数据分类表是选择实体的直接依据;</td>
</tr>

<tr>
<td class="org-left">*实体与属性的最大困难是如何区分实体与属性</td>
</tr>
<tbody>
<tr>
</tr>
</tbody>
</table>
<p>
&lt;  #3.选择实体的关键字属性:
</p>
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">*实体的存在依赖于其关键字的存在;</td>
</tr>
<tbody>
<tr>
</tr>
</tbody>

<tr>
<td class="org-left">#4.确定实体之间的联系</td>
</tr>

<tr>
<td class="org-left">*数据间的联系必须在概念设计时确定;</td>
</tr>
<tbody>
<tr>
</tr>
</tbody>

<tr>
<td class="org-left">#5.确定实体的属性</td>
</tr>
</tbody>
</table>
<p>
╰    *属性分为标识属性(主属性)和说明属性(一般属性)
</p>

<p>
3&gt;逻辑设计方法(综合应用)
  *逻辑结构设计方法的三项具体工作:
   *1.将E-R图转化为关系模型;
   *2.对关系数据模型进行优化;
   *3.设计面向用户的子模式;
</p>

<p>
1)将E-R图转化为关系模型(解答题**)
  #1.一个实体转换为一个关系模型,实体的属性作为关系的属性,实体的码作为关系的码;
  #2.一个一对一联系可以转换为一个独立的关系模式,也可以与任意一端对应的关系模式合并;
  #2.一个一对多联系可以转换为一个独立的关系模式,也可以与任意N端对应的关系模式合并;
  #3.一个多对多联系转换为一个关系模式
  #4.三个或以上实体间的一个多元联系可以转换为一个关系模式;
  #5.具有相同码的关系模式可合并;
</p>

<p>
步骤：
 *1.实体名-&gt;表名,在对应表名后把图中相连接的属性名依次抄下来;
	#1.将E-R按实体拆分,列出实体;(找□)用户,
	#2.将实体的属性,列在实体后面;(归类○)用户:用户id,年龄,用户名
</p>

<p>
*2.确定实体与实体之间的联系是1:N还是M:N:
   #1.当两个实体是1:N(一对多):在多的关系表后,写上一的关系表的主属性;
	  1的表中的主键是N的那个实体表中的外键
	  (找◇)用户:id,所属用户组(1:N或1:1 用户(N):用户组(1) )
</p>

<p>
#2.当两个实体是M:N(多对多)的关系:
   就不能在其中一个实体中建外码而是建立一个 中间表 ;
   #1.以两表之间的联系为实体(表名);
   #2.将两边表中的主码作为该表的联合主键
   #3.同联系的属性一起作为该表的属性;
	  *若联系无属性则定义一个属性作为该关系的键(一般定义联系名+ID);
</p>

<p>
2)对关系数据模型进行优化
  *1.目的:
	 数据库逻辑设计的结果,不是唯一的,
	 要进一步提高数据库应用系统的性能,
	 根据需要适当的修改,调整数据模型的结构;
</p>

<p>
*2.优化方法:
   #1.确定各属性间的函数依赖关系;
</p>

<p>
#2.对于各个关系模式之间的数据依赖进行极小化处理,消除冗余的联系.
</p>

<p>
#3.判断每个关系模式的范式,根据实际需要确定最合适的范式;
</p>

<p>
#4.按照需求分析阶段得到的处理要求,分析这些模式对于这样的应用环境是否合适,
   确定是否对某些模式进行合并和分解;
</p>

<p>
#5.对关系模式进行必要的分解,提高数据操作的效率和存储空间的利用率;
</p>

<p>
3)设计面向用户的子模式
  #1.可以通过视图机制在设计用户视图时,重新定义某些属性的别名,使其更符合用户的习惯,以方便使用.
  #2.可以对不同级别的用户定义不同的视图,以保证系统的安全性;
  #3.简化用户对系统的使用;
</p>

<p>
4&gt;物理设计方法(识记)
 1)建立索引(逻辑连接)
   *1静态建立索引(长期)
   *2动态建立索引(临时)
</p>

<p>
2)建立聚集(物理聚集)
  *1.聚集是将相关数据集中存放的物理存储及技术
  *2.数据聚集结构的一种有效方式是块结构方式
  *3.数据聚集在一个或多个关系上建立;
</p>

<p>
5&gt;简述数据库应用软件设计与实现的基本步骤
  数据库应用软件设计与开发过程可由
  需求分析、
  系统功能与数据库的设计,
  系统功能与数据库实现,
  测试与维护等阶段构成;
</p>

<p>
6&gt;简述系统测试与维护的作用
  完成系统的实现工作后,在正式交付用户使用之前,需要对所开发的系统进行必要的测试,验证其是否满足用户的功能要求
  并根据测试的结果,以及用户的反馈意见,对该系统进行进一步的修改,完善和维护工作;
</p>


<p>
7&gt;模式,外模式和内模式的基本对象包括:
  *1.数据库模式
  *2.表
  *3.索引
  *4.视图
</p>
</div>
</div>
</div>
