org/数据库系统原理笔记.org
** SQL概述
   1>SQL的概念(Structured Query Language, SQL)(选择填空)
     结构化查询语言是专门用来与数据库通信的语言,它可以帮助用户操作关系数据库;
     实现数据库行为是实现数据库行为设计的结果,主要是通过SQL语言完成与本应用功能相关的增、删、改、查等数据库操作，
	 包括为提高数据库操作效率或保护数据库安全而创建的各种数据库对象，
	 例如子查询、视图、触发器(不能施加完整性约束)、存储过程或存储函数等。

   2>SQL的特点(选择填空)
	     ╭#1.SQL不是某个特定数据库供应商专有的语言;
	 特点<#2.SQL简单易学;
	     ╰#3.SQL强大,灵活,可以进行非常复杂和高级的数据库操作;

   3>SQL的组成(数据查询,定义,操纵,控制)

              ╭
              |                           ╭#1.create :创建数据库或数据库对象
              | *1.数据定义语言(DDL)       <#2.alter : 对数据库或数据库对象进行修改;    (对数据库)
              |(Data Definition Language) ╰#3.drop :  删除数据库或数据库对象;
              |
              |
              |                             ╭#1.insert : 将数据插入到表或视图中;(增)
              |                             |#2.delete : 从表或视图中删除数据;(删)
    SQL的组成 <  *2.数据操纵语言(DML)        <                                        (对表中数据项)
              |(Data Manipulation Language) |#3.update : 修改表或视图中的数据;(改)
              |                             ╰#4.select : 从表或视图中检索数据;(查)
              |
              |
              |                         ╭#1.grant : 用于授予权限;
              | *3.数据控制语言(DCL)    <                             (数据库的控制权限)
              |(Data Control Language)  ╰#2.revoke : 用于收回权限;
              ╰

   4>SQL的安装及配置:
      ╭	mysql的启动:
      |	cmd->mysql -u root -p
      |	Enter password: root
     < 	SHOW DATABASES;
      |	//修改密码
      |	ALTER USER 'root'@'localhost' IDENTIFIED BY '新密码';
      ╰	*命令不分大小写,但结束时必须用";",退出用/q;或exit;或quit;如果->是换行,结束时输入";"就可以了;

** MySQL预备知识

   1>MySQL使用基础(选择填空)
	 1)关系数据库管理系统(RDBMS)
       优点:体积小,速度快,开放源代码,遵循GPL

   2>架构方式
	 #1.LAMP-->Linux(系统) :  Apache(web服务器) MySQL(数据库管理系统) PHP,Perl,Python(服务器端脚本解释器)
	 #2.WAMP-->windows(系统) :Apache(web服务器) MySQL(数据库管理系统) PHP,Perl,Python(服务器端脚本解释器)

   3>MySQL扩展语言要素(领会)
	 1)常量(不变的值)
	 	 ╭ #1.字符串常量:称为字面值或标量值,用单引号或双引号括起来的字符序列
     	 |    分为ASCII字符串常量(0-255)和Unicode字符串常量(汉字);
         |
     	 | #2.数值常量:整数常量 浮点数常量
     	 |
     	 | #3.十六进制常量:每对十六进制数字被转换为一个字符,其最前面有一个字母'X'(或"x")
        <
     	 | #4.时间日期常量: 用单引号将表示时间的字符串括起来而构成的,例如'2018-06-05'
     	 |
         | #5.位字段值:格式: b'value'->二进制
     	 |
     	 | #6.布尔值: true->1, false->0
     	 |
     	 ╰ #7.NULL值: 无数据

	 2)变量
	    ╭#1.用户变量:用户变量前常添加一个符号@,用于将其与列名区分开;
       <
		╰#2.系统变量:大多数系统变量应用于其他SQL语句中时,必须在系统变量前加两个@

	 3)运算符

	   ╭#1.算术运算符:  +(加),-(减),*(乘),/(除)(取整),%(求模)(取余)
       |
	   |#2.位运算符:  &(位与),|(位或),^(位异或),~(位取反),>>,(位右移),<<(位左移).
      <
	   |#3.比较运算符:=(等于),>(大于),<(小于),>=(大于等于),<=(小于等于),<>(不等于),!=(不等于),<=>(相等或都等于空);
	   |
	   ╰#4.逻辑运算符: NOT或!(逻辑非),AND或&&(逻辑与),OR或||(逻辑或),XOR(逻辑异或)

	 4)表达式
		*表达式是常量,变量,列名,复杂计算,运算符和函数的组合

		╭ #1.字符型表达式:SNO
        |
	    | #2.数值型表达式:
        |
	    | #3.日期型表达式:'2018-07-19'
        |
        |             ╭*1.数学函数------>ABS()
       <              |*2.聚合函数------>COUNT()
        |             |*3.字符串函数---->ASCII()
        |             |*4.时间日期函数-->NOW()
        | #4.内置函数 < *5.加密函数------>ENCODE()
        |             |*6.控制流程函数-->IF()
        |             |*7.格式化函数---->FORMAT()
        |             | *8.类型转换函数-->CAST()
        ╰             ╰*9.系统信息函数-->USER()


	 *.SQL集数据查询、数据定义、数据操纵和数据控制四大功能于一体，
	  其核心主要包含有以下几个部分：

	   *1.数据定义语言

	   *2.数据操纵语言

	   *3.数据控制语言

	   *4.嵌入式和动态SQL规则:规定了SQL语句在高级程序设计语言中使用的规范方法，
	      以便适应较为复杂的应用。

	   *5.SQL调用和会话规则 ：SQL调用包括SQL例程和调用规则，
	      以便提高SQL的灵活性有效性、共享性以及使SQL具有更多的高级语言的特征；
	      SQL会话规则 可使应用程序连接到 多个SQL服务器 中的某一个，并与之交互。

	   *6.基本表是本身独立存在的表，MySQL中一个关系对应一个基本表，
	      一个或多个基本表对应一个存储文件，一个表可以有若干索引，
	      索引也存放在存储文件中。视图是从一个或几个基本表导出的表。

