public/数据库系统原理笔记.html

<div id="outline-container-org0abf0d3" class="outline-2">
<h2 id="org0abf0d3">SQL与关系数据库基本操作</h2>
<div class="outline-text-2" id="text-org0abf0d3">
</div>
<div id="outline-container-org6768e65" class="outline-3">
<h3 id="org6768e65">SQL概述</h3>
<div class="outline-text-3" id="text-org6768e65">
<p>
1&gt;SQL的概念(Structured Query Language, SQL)(选择填空)
  结构化查询语言是专门用来与数据库通信的语言,它可以帮助用户操作关系数据库;
  实现数据库行为是实现数据库行为设计的结果,主要是通过SQL语言完成与本应用功能相关的增、删、改、查等数据库操作，
  包括为提高数据库操作效率或保护数据库安全而创建的各种数据库对象，
  例如子查询、视图、触发器(不能施加完整性约束)、存储过程或存储函数等。
</p>

<p>
2&gt;SQL的特点(选择填空)
	  ╭#1.SQL不是某个特定数据库供应商专有的语言;
  特点&lt;#2.SQL简单易学;
	  ╰#3.SQL强大,灵活,可以进行非常复杂和高级的数据库操作;
</p>

<p>
3&gt;SQL的组成(数据查询,定义,操纵,控制)
</p>

<p>
╭
</p>
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">╭#1.create :创建数据库或数据库对象</td>
</tr>

<tr>
<td class="org-left">*1.数据定义语言(DDL)       &lt;#2.alter : 对数据库或数据库对象进行修改;    (对数据库)</td>
</tr>

<tr>
<td class="org-left">(Data Definition Language) ╰#3.drop :  删除数据库或数据库对象;</td>
</tr>
<tbody>
<tr>
</tr>
</tbody>
<tbody>
<tr>
</tr>
</tbody>

<tr>
<td class="org-left">╭#1.insert : 将数据插入到表或视图中;(增)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">#2.delete : 从表或视图中删除数据;(删)</td>
</tr>
</tbody>
</table>
<p>
SQL的组成 &lt;  *2.数据操纵语言(DML)        &lt;                                        (对表中数据项)
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">(Data Manipulation Language)</td>
<td class="org-left">#3.update : 修改表或视图中的数据;(改)</td>
</tr>

<tr>
<td class="org-left">╰#4.select : 从表或视图中检索数据;(查)</td>
</tr>
<tbody>
<tr>
</tr>
</tbody>
<tbody>
<tr>
</tr>
</tbody>

<tr>
<td class="org-left">╭#1.grant : 用于授予权限;</td>
</tr>

<tr>
<td class="org-left">*3.数据控制语言(DCL)    &lt;                             (数据库的控制权限)</td>
</tr>

<tr>
<td class="org-left">(Data Control Language)  ╰#2.revoke : 用于收回权限;</td>
</tr>
</tbody>
</table>
<p>
╰
</p>

<p>
4&gt;SQL的安装及配置:
   ╭	mysql的启动:
</p>
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">cmd-&gt;mysql -u root -p</td>
</tr>

<tr>
<td class="org-left">Enter password: root</td>
</tr>
</tbody>
</table>
<p>
&lt; 	SHOW DATABASES;
</p>
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">//修改密码</td>
</tr>

<tr>
<td class="org-left">ALTER USER 'root'@'localhost' IDENTIFIED BY '新密码';</td>
</tr>
</tbody>
</table>
<p>
╰	*命令不分大小写,但结束时必须用";",退出用/q;或exit;或quit;如果-&gt;是换行,结束时输入";"就可以了;
</p>
</div>
</div>

<div id="outline-container-orge474d00" class="outline-3">
<h3 id="orge474d00">MySQL预备知识</h3>
<div class="outline-text-3" id="text-orge474d00">
<p>
1&gt;MySQL使用基础(选择填空)
  1)关系数据库管理系统(RDBMS)
	优点:体积小,速度快,开放源代码,遵循GPL
</p>

<p>
2&gt;架构方式
  #1.LAMP&#x2013;&gt;Linux(系统) :  Apache(web服务器) MySQL(数据库管理系统) PHP,Perl,Python(服务器端脚本解释器)
  #2.WAMP&#x2013;&gt;windows(系统) :Apache(web服务器) MySQL(数据库管理系统) PHP,Perl,Python(服务器端脚本解释器)
</p>

<p>
3&gt;MySQL扩展语言要素(领会)
  1)常量(不变的值)
	   ╭ #1.字符串常量:称为字面值或标量值,用单引号或双引号括起来的字符序列
</p>
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">分为ASCII字符串常量(0-255)和Unicode字符串常量(汉字);</td>
</tr>
<tbody>
<tr>
</tr>
</tbody>

<tr>
<td class="org-left">#2.数值常量:整数常量 浮点数常量</td>
</tr>
<tbody>
<tr>
</tr>
</tbody>

<tr>
<td class="org-left">#3.十六进制常量:每对十六进制数字被转换为一个字符,其最前面有一个字母'X'(或"x")</td>
</tr>
</tbody>
</table>
<p>
&lt;
</p>
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">#4.时间日期常量: 用单引号将表示时间的字符串括起来而构成的,例如'2018-06-05'</td>
</tr>
<tbody>
<tr>
</tr>
</tbody>

<tr>
<td class="org-left">#5.位字段值:格式: b'value'-&gt;二进制</td>
</tr>
<tbody>
<tr>
</tr>
</tbody>

<tr>
<td class="org-left">#6.布尔值: true-&gt;1, false-&gt;0</td>
</tr>
<tbody>
<tr>
</tr>
</tbody>
</table>
<p>
╰ #7.NULL值: 无数据
</p>

<p>
2)变量
   ╭#1.用户变量:用户变量前常添加一个符号@,用于将其与列名区分开;
  &lt;
   ╰#2.系统变量:大多数系统变量应用于其他SQL语句中时,必须在系统变量前加两个@
</p>

<p>
3)运算符
</p>

<p>
╭#1.算术运算符:  +(加),-(减),*(乘),/(除)(取整),%(求模)(取余)
</p>
<table>


<tbody>
<tr>
</tr>
</tbody>

<tr>
<td class="org-left">#2.位运算符:  &amp;(位与),</td>
<td class="org-left">(位或),<sup>(位异或)</sup>,~(位取反),&gt;&gt;,(位右移),&lt;&lt;(位左移).</td>
</tr>
</tbody>
</table>
<p>
&lt;
</p>
<table>


<colgroup>
<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">#3.比较运算符:=(等于),&gt;(大于),&lt;(小于),&gt;=(大于等于),&lt;=(小于等于),&lt;&gt;(不等于),!=(不等于),&lt;=&gt;(相等或都等于空);</td>
</tr>
<tbody>
<tr>
</tr>
</tbody>
</table>
<p>
╰#4.逻辑运算符: NOT或!(逻辑非),AND或&amp;&amp;(逻辑与),OR或||(逻辑或),XOR(逻辑异或)
</p>

<p>
4)表达式
   *表达式是常量,变量,列名,复杂计算,运算符和函数的组合
</p>

<p>
╭ #1.字符型表达式:SNO
</p>
<table>


<tbody>
<tr>
</tr>
</tbody>

<tr>
<td class="org-left">#2.数值型表达式:</td>
</tr>
<tbody>
<tr>
</tr>
</tbody>

<tr>
<td class="org-left">#3.日期型表达式:'2018-07-19'</td>
</tr>
<tbody>
<tr>
</tr>
</tbody>

<tr>
<td class="org-left">╭*1.数学函数-&#x2013;&#x2014;&gt;ABS()</td>
</tr>
</tbody>
</table>
<p>
&lt;              |*2.聚合函数-&#x2013;&#x2014;&gt;COUNT()
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">*3.字符串函数-&#x2014;&gt;ASCII()</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">*4.时间日期函数&#x2013;&gt;NOW()</td>
</tr>

<tr>
<td class="org-left">#4.内置函数 &lt; *5.加密函数-&#x2013;&#x2014;&gt;ENCODE()</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">*6.控制流程函数&#x2013;&gt;IF()</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">*7.格式化函数-&#x2014;&gt;FORMAT()</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">*8.类型转换函数&#x2013;&gt;CAST()</td>
</tr>
</tbody>
</table>
<p>
╰             ╰*9.系统信息函数&#x2013;&gt;USER()
</p>


<p>
*.SQL集数据查询、数据定义、数据操纵和数据控制四大功能于一体，
 其核心主要包含有以下几个部分：
</p>

<p>
*1.数据定义语言
</p>

<p>
*2.数据操纵语言
</p>

<p>
*3.数据控制语言
</p>

<p>
*4.嵌入式和动态SQL规则:规定了SQL语句在高级程序设计语言中使用的规范方法，
   以便适应较为复杂的应用。
</p>

<p>
*5.SQL调用和会话规则 ：SQL调用包括SQL例程和调用规则，
   以便提高SQL的灵活性有效性、共享性以及使SQL具有更多的高级语言的特征；
   SQL会话规则 可使应用程序连接到 多个SQL服务器 中的某一个，并与之交互。
</p>

<p>
*6.基本表是本身独立存在的表，MySQL中一个关系对应一个基本表，
   一个或多个基本表对应一个存储文件，一个表可以有若干索引，
   索引也存放在存储文件中。视图是从一个或几个基本表导出的表。
</p>
</div>
</div>
