org/数据库系统原理笔记.org
** 数据定义

   1>数据库模型定义(简答题)

	  *只有成功创建数据库之后,才能在数据库中创建数据表,
	   数据表被定义为字段集合数据在表中是按照行和列的格式来存储的,
	   每一行代表一条记录，每一列代表记录中一个字段的取值。

	  1)创建数据库
	   mysql> create database if not exists db_name;

	   使用Create database;或Create schema;语句
	   create {database|schema}[if not exists] db_name  (数据库名)
	   [default]character set[=]charset_name		   (字符集名)
	   [default]collate[=]collation_name			   (排序规则)

	   []表示其内容为可选项;|用于分割花括号中的选项;
	   create database mysql_test;创建mysql_test数据库
	   show databases;查看数据库

	  2)选择数据库
	    use db_name; 从一个数据库跳转到另一个数据库;

	  3)修改数据库
	    alter database db_name;修改数据库名字

		mysql> alter database mysql_test
			-> default character set gb2312       修改字符集
			-> default collate gb2312_chinese_ci; 修改校对规则

        mysql> show variables like '%char%';检查字符集是否修改成功

		mysql> show collation; 检查校对规则是否修改成功

	  4)删除数据库

		mysql> drop database if exists db_name;

	  5)查看数据库
	    show{databases|schemas} [like 'pattem'|where]

		where 查找符合条件

		like  查找关键字:

		mysql> show databases like 'mysql_test';

		mysql> show databases like 'm%';模糊匹配(%->通配符)



	 2>定义表(解答题)
	  1)创建表语句
	    create [temporary(临时表)]table tbl_name(字段名1数据类型,符合完整性约束);

		mysql> use mysql_test;
        Database changed
        mysql> create table if not exists customers
			-> (
			-> cust_id int not null auto_increment,(自增:auto_increment)
			-> cust_name char(50) not null,
			-> cust_gender char(1) not null,
			-> cust_address char(50) null,
			-> cust_contact char(50) null,
			-> primary key(cust_id)                 (主键:primary key(属性名))
			-> );

		mysql> show tables like 'customers';

	  2)更新表
	   *alter table db_name.tbl_name  (选择表)

	   *1 往表中增加一列
   	      add column column_name type limit default value position (操作表)

	      mysql> alter table mysql_test.customers
			  -> add column cust_city char(10) not null default 'Wuhan'after cust_gender;

          *注意:MySQL增加列指定位置时没有BEFORE的用法,第一列可以使用FIRST,非第一列使用AFTER。

	   *2.更改表的列名
	      change column old_name new_name type limit default value ;

		  mysql> alter table mysql_test.customers
			  -> change column cust_gender gender char(1) not null default 'M';

	   *3.修改指定列的默认值
	      alter column column_name set default 'value';

		  mysql> alter table mysql_test.customers
			  -> alter column cust_city set default 'Beijing';

	   *4.更改表中指定列的数据类型,不干涉它的列名.
	      modify column column_name type(数据类型);

		  mysql> alter table mysql_test.customers
			  -> modify column cust_name char(20) first;(首列)

	   *5.删除列表中指定的列
          drop column column_name;

		  mysql> alter table mysql_test.customers
			  -> drop column cust_contact;

	   *6.为表重命名
		 rename to db_name.new_tbl_name;

		 mysql> alter table mysql_test.customers
			 -> rename to mysql_test.backup_customers;

	     rename table db_name.old_tbl_name to db_name.new_tbl_name;(不用alter table)

	  3).删除表
	     drop table if exists tbl_name1,tbl_name2;

		 mysql> drop table if exists backup_customers;

      4).查看表及表中的各列
		show tables like 'tbl_name';(查看表)
		show columns from db_name.tbl_name;(查看指定表的各列)
		desc mysql_test.customers;(这个功能同上) (desc-->describe)

		mysql> show columns from mysql_test.customers;
		mysql> desc mysql_test.customers;

	 3>定义索引(解答题)

	  1)定义
		所谓索引,就是DBMS根据表中的一列或若干列按照一定顺序建立的列值与记录行之间的对应关系表;

	  2)索引存在的弊端:
	    *1.索引是以文件的形式存储的,DBMS会将一个表的所有索引保存在同一个索引文件中,索引需要占用大量磁盘空间;
		*2.索引在提高查询速度的同时,会降低更新表的速度;

	  3)分类
	    *1.普通索引(Index或key)
		*2.唯一索引(unique) :与普通索引类型不同的是唯一索引的列值必须唯一，但允许为空值。
		*3.主键(primary key)

		*索引通常被创建成单列索引和组合索引;

	  4)索引的创建

	    *1.单列索引:
	    create index index_name
	    ->on db_name.tbl_name(column_name(Length) asc/desc);

        示例:
        在数据库mysql_test的表
		create index index_customers
        -> on mysql_test.customers(cust_name(3) asc);

		*2.组合索引:
		 create index index_name on db_name.tbl_name(column1,column2)

		 mysql> create index index_cust
			 -> on mysql_test.customers(cust_name,cust_id);

		*3.使用create table 语句创建
		 #1.[constraint[symbol]]primary key(index_col_name,....),
		   用于表示在创建新表的同时创建该表的主键;

		 #2.{index|key}index_name(index_col_name,...),
		    用于表示在创建新表的同时创建该表的索引;

		 #3.[constraint][symbol] unique index_name (index_col_name,...);
		   用于表示在创建新表的同时创建该表的唯一性索引

		 #4.[constraint][symbol] foreign key index_name(index_col_name,.);
		   用于表示在创建新表的同时创建该表的外键

		 mysql> create table if not exists seller
			 -> (
			 -> seller_id int not null auto_increment,
			 -> seller_name char(50) not null,
			 -> seller_address char(50) null,
			 -> seller_contact char(50) null,
			 -> product_type int(5) null,
			 -> sales int null,
			 -> primary key(seller_id,product_type),
			 -> index index_seller(sales)
			 -> );

		*4.使用alter table语句创建
		 #1.add{index\key}[index_name](index_col_name,..)
		   用于表示在修改表的同时为该表添加索引

		   mysql> alter table mysql_test.seller
			   -> add index index_seller_name(seller_name);

		 #2.add[constraint[symbol]Primary Key(index_col_name,...)
		   用于表示在修改表的同时为该表添加主键

		 #3.add unique[index|key][index_name](index_col_name,...)
		   用于表示在修改表的同时为该表添加唯一性索引

		 #4.add[constraint[symbol]] foreign key(col_name) references tab2(col_name)
		   用于表示在创建新表的同时为该表添加外键

		 *index_col_name==>column_name

		*5.索引的查看(show index)

		  show{index|indexes|keys}
		  {from|in}tbl_name[{from|in}db_name]
		  [where expr]

		  mysql> show keys from seller;

	    *6.索引的删除

		  #1.drop index index_name on tbl_name;

 		    mysql> drop index index_cust on mysql_test.customers;

		  #2.alter table tbl_name drop primary key 删主键

			mysql> alter table mysql_test.customers
				-> drop primary key,
				-> drop index index_customers;

		  #2.alter table tbl_name drop index index_name  删普通索引

		  #3.alter table tbl_name drop foreign key 删外键

	4.数据更新

	 1>插入数据(解答题)(insert)

	  1)插入行完整列值数据(insert..values)
	   insert tbl_name(col_name,...){values}(expr|Default,...),(..),

	   mysql> insert mysql_test.customers
		   -> values(901,'zhansan','F','beijing','chaoyang');

	  2)插入行部分列值数据(insert..set)
	   insert[into]tbl_name set col_name=expr|Default,...

	   mysql> insert into mysql_test.customers
		   -> set cust_name='lisi',cust_address='wuhai',gender=default;

	  3)插入子查询数据(insert...select)
        //选择值赋给对应字段
        insert into tbl_name2(col_name1,...) select value1,...;
        示例:
        insert mysql_test.infos(user_name,user_city)select 'LiLi','HeBei';
        //将表1中部分数据复制插入到表2中
        insert into tbl_name2(a,c,b...) select a,c,5... from tbl_name1;

	 2>删除一行或多行数据(解答题)(delete)
	   delete from tbl_name
	   where where_condition
	   order by... limit row_count

	   mysql> delete from mysql_test.customers
		   -> where cust_name='lisi';

	 3>修改数据(解答题)(update)
	   update tbl_name
	   set col_name=expr|Default,col_name2=expr|Default,....
	   where where_condition
	   order by... limit row_count

	   mysql> update mysql_test.customers
		   -> set cust_address='wuhanshi'
		   -> where cust_name='zhansan';

	5.数据查询

	 1>select语句
	   select select_expr(要查的值)
			  from table_references (数据来源),
			  where where_condition(数据的选择条件)
			  group by col_name|expr|position(对检索到的记录进行分组)
			  ASC|DESC, with rollup
			  having where_condition (指定组的选择条件)
			  order by col_name|expr|position(对查询结果进行排序)
			  asc/desc,...
			  limit offset row_count|row_count Offset (限制行数)

	  1)列的选择和指定

	    select col_name,col_name2,... from db_name.tbl_name;(查询某表指定列)

		select * from db_name.tbl_name;(查询表中所有列)

		mysql> select cust_name,cust_address,gender
			-> from mysql_test.customers;

		mysql> select * from mysql_test.customers;


	  2)定义并使用列的别名

		col_name as col_alias (列的别名)(这个查询的只是虚表,表中真实的col_name没有变)

		mysql> select cust_address as dizhi
			-> from mysql_test.customers;

	  3)替换查询结果集中的数据(case)

	    case when 条件1 then 表达式1
		       when 条件2 then 表达式2

			 else 表达式

			 end as col_alias;

	    mysql> select cust_name,
			-> case
			-> when gender='F'then 'nan'
			-> else 'nv'
			-> end as sex
			-> from mysql_test.customers;

	  4)计算列值

		mysql> select cust_id+199
			-> from mysql_test.customers;

	 2>聚合函数(系统内置函数)

	  1)count        求组中项数,返回int类型整数

	  2)max   		 求最大值

	  3)min	  		 求最小值

	  4)sum	  	     返回表达式中所有值的和

	  5)avg          求组中值的平均值

	  6)std或stdDev  返回给定表达式中所有值的标准值

	  7)variance	 返回给定表达式中所有值的方差

	  8)group_concat 返回由属于一组的列值连接组合而成的结果

	  9)bit_and       逻辑与

	  10)bir_or		  逻辑或

	  11)bit_xor	  逻辑异或

	  *聚合函数经常与group by联合使用;

	 3>from子句与多表连接查询(综合应用)
	  1)交叉连接,又称笛卡尔积;
		select * from tab1 cross join tbl2;
		select * from tab1,tab2;
		mysql> select * from tab1,tab2;

	  2)内连接
	    tab1 col_name1 比较运算符 tab2 col_name2
	    select some columns(列名)
		from table1
		inner join (内连接)
		table2
		on some conditions(条件)

		mysql> select * from student
			-> inner join tbl_score
			-> on student.studentno=tbl_score.studentno;

		内连接分类:
		*1.等值连接:使用运算符=(*这个是考点)
		*2.非等值连接:使用除=之外的其他比较运算符(>,<,!=)
		*3.自连接:将一个表与它自身进行连接

	   内连接含义:(解答题)
	    内连接是一种最常用的连接类型,它是通过在查询中设置连接条件的方式,
	    来移除查询结果集中某些数据行之后的交叉连接.

	  3)外连接
	   *1.左外连接:在from子句中使用关键字left outer join或left join;(以左表为基表)

		   mysql> select * from student left join tbl_score
			   -> on student.studentno=tbl_score.studentno;  (student是基表)

	   *2.右外连接:在from子句中使用关键字right outer join或right join;(以右表为基表)

		  mysql> select * from student right join tbl_score
			  -> on student.studentno=tbl_score.studentno;   (tbl_score是基表)


	 4>where子句与条件查询

	  1)比较运算: 比较两方有null值除<=>这个符号.,其他返回unknown.<=>返回true/false;

	  2)条件查询:
	    mysql> select * from mysql_test.customers
			-> where gender='F';

	  3)查询范围(between and)
	    *1.当查询的过滤条件被限定在值的某个范围时,可以使用关键字"between"
		   expression [NOT] BETWEEN expression1 AND expression2
		   当不使用关键字“NOT”时，值在表达式expression1和expression2之间（包括这两个值）
		   如果使用关键字“NOT”时，其返回值正好相反。<expression1 或 >expression2

		   mysql> select * from mysql_test.customers
		       -> where cust_id between 900 and 901;

		*2.使用关键字"in" 可以指定一个值的枚举表,该表中会列出所有可能的值.
		  mysql> select * from mysql_test.customers
			  -> where cust_id in(900,901,908);

	  4)判定空值
	    *is null
		 mysql> select cust_name from mysql_test.customers
			 -> where cust_contact is null;

	  5)子查询
		*1.根据返回结果分类:(***解答题***)

	       #1.表子查询:返回的结果集是一个表。

		   #2.行子查询:返回的结果集是带有一个或多个值的一行数据。

		   #3.列子查询:返回的结果集是一列数据，该列可以有一行或多行，但每行只有一个值。

		   #4.标量子查询:返回的结果集仅仅是一个值。

		*2.子查询结合关键字"in" 使用的子查询,主要用于判断一个给定的值是否存在于子查询的结果集中.

		   语法: expression(表达式) in subquery(子查询集)

		   mysql> select studentno,student_name
			   -> from student where studentno in    (找到外键,用外键连接两个表)
			   -> (select studentno from tbl_score where score>80); (循环嵌套选择列)


		   取反  (<=80)
		   mysql> select studentno,student_name
			   -> from student
			   -> where studentno not in(select studentno from tbl_score where score>90);

		*3.结合比较运算符使用子查询

			语法:expression{=|<=|>|>=|<=>|<>|!=}{all|some|any}(subquery)(子查询语句)

			*:in-> =any-> =some;
			mysql> select studentno,student_name
				-> from student
				-> where studentno =any(select studentno from tbl_score where score>80);

			mysql> select studentno,student_name
				-> from student
				-> where studentno =some(select studentno from tbl_score where score>80);

			*:not in-><>all
			mysql> select studentno,student_name
				-> from student
				-> where studentno <>all(select studentno from tbl_score where score>90);

			*:=(精确到条目)
			mysql> select studentno,student_name
				-> from student
				-> where studentno =(select studentno from tbl_score where score=90);

		*4.结合关键字"exists"使用的子查询
		   语法:exists(subquery)
		   mysql> select studentno,student_name
			   -> from student
			   -> where exists(select studentno from tbl_score where student.studentno=tbl_score.studentno);

		*5.指定查询条件的WHERE子句

	      在指定查询条件的WHERE子句中，可以使用子查询的结果集作为过滤条件的一部分，
		  并且子查询通常会与关键字“IN”“EXIST”和比较运算符结合使用。

		  #1.结合关键字“IN”使用的子查询：主要用于判定一个给定值是否存在于子查询的结果集中。

		  #2.结合比较运算符使用的子查询：主要用于将表达式的值和子查询的结果进行比较运算。

		  #3.结合关键字“EXISTS”使用的子查询：主要用于判定子查询的结果集是否为空。

	 5>group by子句与分组数据(综合应用)
	1)语法:
	  /**
	   * col_name1   指定聚合函数的条件依据
	   * col_name2   指定用于分组的选择列
	   * expr        指定用于分组的表达式
	   * position    指定用于分组的列在SELECT语句结果集中的位置，通常是一个正整数
       * asc|desc    ASC表示升序排列， DESC表示降序。默认ASC
       * with rollup 可选项，指定在结果集中不仅包含由GROUP BY子句分组后的数据行，
       * 还包含各分组的汇总行，以及所有分组的整体汇总行，可以得到每个分组以及每个分组汇总级别的值
       * 作用:去重复,查找表CT中有多少讲师记录(按姓名分组,排重)
	   */
	  select col_name1,...,from tbl_name
	  group by{col_name2|expr|position}[asc|desc],...[with rollup]

      示例:将表TC按课程和讲师姓名分组,根据讲师姓名获取每位讲师的授课项数;
       mysql> select CName,count(*) as '授课项数'
           -> from CT group by CName,CTitle;
           +-------+--------+
           | CName | 授课项数|
           +-------+--------+
           | 小涵  |      1 |
           | 爱敏  |      2 |
           | 王月  |      1 |
           +-------+--------+

      示例:将表TC按课程和讲师姓名分组,根据讲师姓名获取每位讲师的授课项数及授课汇总;
      mysql> select CTitle,CName,count(*) as '授课项数'
          -> from CT group by CName,CTitle with rollup;//(汇总)(有总字就加这个)

          +----------+-------+----------+
          | CTitle   | CName | 授课项数 |
          +----------+-------+----------+
          | C++      | 爱敏  |        1 |
          | 数据结构  | 爱敏  |        1 |
          | NULL     | 爱敏  |        2 |--->爱敏授课数总计2项
          | 信息系统  | 王月  |        1 |
          | NULL     | 王月  |        1 |--->王月授课数总计1项
          | 数据库    | 小涵  |        1 |
          | NULL     | 小涵  |        1 |--->小涵授课数总计1项
          | NULL     | NULL  |        4 |--->全部授课数共计4项
          +----------+-------+----------+

      *简述对于 GROUP BY 子句的使用，需要注意哪些内容？
