public/数据库系统原理笔记.html

<div id="outline-container-org8d8e40c" class="outline-3">
<h3 id="org8d8e40c">数据定义</h3>
<div class="outline-text-3" id="text-org8d8e40c">
<p>
1&gt;数据库模型定义(简答题)
</p>

<p>
*只有成功创建数据库之后,才能在数据库中创建数据表,
 数据表被定义为字段集合数据在表中是按照行和列的格式来存储的,
 每一行代表一条记录，每一列代表记录中一个字段的取值。
</p>

<p>
1)创建数据库
 mysql&gt; create database if not exists db<sub>name</sub>;
</p>

<p>
使用Create database;或Create schema;语句
create {database|schema}[if not exists] db<sub>name</sub>  (数据库名)
[default]character set[=]charset<sub>name</sub>     (字符集名)
[default]collate[=]collation<sub>name</sub>      (排序规则)
</p>

<p>
[]表示其内容为可选项;|用于分割花括号中的选项;
create database mysql<sub>test</sub>;创建mysql<sub>test数据库</sub>
show databases;查看数据库
</p>

<p>
2)选择数据库
  use db<sub>name</sub>; 从一个数据库跳转到另一个数据库;
</p>

<p>
3)修改数据库
  alter database db<sub>name</sub>;修改数据库名字
</p>

<p>
mysql&gt; alter database mysql<sub>test</sub>
	-&gt; default character set gb2312       修改字符集
	-&gt; default collate gb2312<sub>chinese</sub><sub>ci</sub>; 修改校对规则
</p>

<p>
mysql&gt; show variables like '%char%';检查字符集是否修改成功
</p>

<p>
mysql&gt; show collation; 检查校对规则是否修改成功
</p>

<p>
4)删除数据库
</p>

<p>
mysql&gt; drop database if exists db<sub>name</sub>;
</p>

<p>
5)查看数据库
  show{databases|schemas} [like 'pattem'|where]
</p>

<p>
where 查找符合条件
</p>

<p>
like  查找关键字:
</p>

<p>
mysql&gt; show databases like 'mysql<sub>test</sub>';
</p>

<p>
mysql&gt; show databases like 'm%';模糊匹配(%-&gt;通配符)
</p>



<p>
2&gt;定义表(解答题)
 1)创建表语句
   create [temporary(临时表)]table tbl<sub>name</sub>(字段名1数据类型,符合完整性约束);
</p>

<p>
mysql&gt; use mysql<sub>test</sub>;
Database changed
mysql&gt; create table if not exists customers
	-&gt; (
	-&gt; cust<sub>id</sub> int not null auto<sub>increment</sub>,(自增:auto<sub>increment</sub>)
	-&gt; cust<sub>name</sub> char(50) not null,
	-&gt; cust<sub>gender</sub> char(1) not null,
	-&gt; cust<sub>address</sub> char(50) null,
	-&gt; cust<sub>contact</sub> char(50) null,
	-&gt; primary key(cust<sub>id</sub>)                 (主键:primary key(属性名))
	-&gt; );
</p>

<p>
mysql&gt; show tables like 'customers';
</p>

<p>
2)更新表
 *alter table db<sub>name.tbl</sub><sub>name</sub>  (选择表)
</p>

<p>
*1 往表中增加一列
	  add column column<sub>name</sub> type limit default value position (操作表)
</p>

<p>
mysql&gt; alter table mysql<sub>test.customers</sub>
	-&gt; add column cust<sub>city</sub> char(10) not null default 'Wuhan'after cust<sub>gender</sub>;
</p>

<p>
*注意:MySQL增加列指定位置时没有BEFORE的用法,第一列可以使用FIRST,非第一列使用AFTER。
</p>

<p>
*2.更改表的列名
   change column old<sub>name</sub> new<sub>name</sub> type limit default value ;
</p>

<p>
mysql&gt; alter table mysql<sub>test.customers</sub>
	-&gt; change column cust<sub>gender</sub> gender char(1) not null default 'M';
</p>

<p>
*3.修改指定列的默认值
   alter column column<sub>name</sub> set default 'value';
</p>

<p>
mysql&gt; alter table mysql<sub>test.customers</sub>
	-&gt; alter column cust<sub>city</sub> set default 'Beijing';
</p>

<p>
*4.更改表中指定列的数据类型,不干涉它的列名.
   modify column column<sub>name</sub> type(数据类型);
</p>

<p>
mysql&gt; alter table mysql<sub>test.customers</sub>
	-&gt; modify column cust<sub>name</sub> char(20) first;(首列)
</p>

<p>
*5.删除列表中指定的列
   drop column column<sub>name</sub>;
</p>

<p>
mysql&gt; alter table mysql<sub>test.customers</sub>
	-&gt; drop column cust<sub>contact</sub>;
</p>

<p>
*6.为表重命名
  rename to db<sub>name.new</sub><sub>tbl</sub><sub>name</sub>;
</p>

<p>
mysql&gt; alter table mysql<sub>test.customers</sub>
	-&gt; rename to mysql<sub>test.backup</sub><sub>customers</sub>;
</p>

<p>
rename table db<sub>name.old</sub><sub>tbl</sub><sub>name</sub> to db<sub>name.new</sub><sub>tbl</sub><sub>name</sub>;(不用alter table)
</p>

<p>
3).删除表
   drop table if exists tbl<sub>name1,tbl</sub><sub>name2</sub>;
</p>

<p>
mysql&gt; drop table if exists backup<sub>customers</sub>;
</p>

<p>
4).查看表及表中的各列
  show tables like 'tbl<sub>name</sub>';(查看表)
  show columns from db<sub>name.tbl</sub><sub>name</sub>;(查看指定表的各列)
  desc mysql<sub>test.customers</sub>;(这个功能同上) (desc&#x2013;&gt;describe)
</p>

<p>
mysql&gt; show columns from mysql<sub>test.customers</sub>;
mysql&gt; desc mysql<sub>test.customers</sub>;
</p>

<p>
3&gt;定义索引(解答题)
</p>

<p>
1)定义
  所谓索引,就是DBMS根据表中的一列或若干列按照一定顺序建立的列值与记录行之间的对应关系表;
</p>

<p>
2)索引存在的弊端:
  *1.索引是以文件的形式存储的,DBMS会将一个表的所有索引保存在同一个索引文件中,索引需要占用大量磁盘空间;
  *2.索引在提高查询速度的同时,会降低更新表的速度;
</p>

<p>
3)分类
  *1.普通索引(Index或key)
  *2.唯一索引(unique) :与普通索引类型不同的是唯一索引的列值必须唯一，但允许为空值。
  *3.主键(primary key)
</p>

<p>
*索引通常被创建成单列索引和组合索引;
</p>

<p>
4)索引的创建
</p>

<p>
*1.单列索引:
create index index<sub>name</sub>
-&gt;on db<sub>name.tbl</sub><sub>name</sub>(column<sub>name</sub>(Length) asc/desc);
</p>

<p>
示例:
在数据库mysql<sub>test的表</sub>
create index index<sub>customers</sub>
-&gt; on mysql<sub>test.customers</sub>(cust<sub>name</sub>(3) asc);
</p>

<p>
*2.组合索引:
 create index index<sub>name</sub> on db<sub>name.tbl</sub><sub>name</sub>(column1,column2)
</p>

<p>
mysql&gt; create index index<sub>cust</sub>
	-&gt; on mysql<sub>test.customers</sub>(cust<sub>name,cust</sub><sub>id</sub>);
</p>

<p>
*3.使用create table 语句创建
 #1.[constraint[symbol]]primary key(index<sub>col</sub><sub>name</sub>,&#x2026;.),
   用于表示在创建新表的同时创建该表的主键;
</p>

<p>
#2.{index|key}index<sub>name</sub>(index<sub>col</sub><sub>name</sub>,&#x2026;),
   用于表示在创建新表的同时创建该表的索引;
</p>

<p>
#3.[constraint][symbol] unique index<sub>name</sub> (index<sub>col</sub><sub>name</sub>,&#x2026;);
  用于表示在创建新表的同时创建该表的唯一性索引
</p>

<p>
#4.[constraint][symbol] foreign key index<sub>name</sub>(index<sub>col</sub><sub>name</sub>,.);
  用于表示在创建新表的同时创建该表的外键
</p>

<p>
mysql&gt; create table if not exists seller
	-&gt; (
	-&gt; seller<sub>id</sub> int not null auto<sub>increment</sub>,
	-&gt; seller<sub>name</sub> char(50) not null,
	-&gt; seller<sub>address</sub> char(50) null,
	-&gt; seller<sub>contact</sub> char(50) null,
	-&gt; product<sub>type</sub> int(5) null,
	-&gt; sales int null,
	-&gt; primary key(seller<sub>id,product</sub><sub>type</sub>),
	-&gt; index index<sub>seller</sub>(sales)
	-&gt; );
</p>

<p>
*4.使用alter table语句创建
 #1.add{index\key}[index<sub>name</sub>](index<sub>col</sub><sub>name</sub>,..)
   用于表示在修改表的同时为该表添加索引
</p>

<p>
mysql&gt; alter table mysql<sub>test.seller</sub>
	-&gt; add index index<sub>seller</sub><sub>name</sub>(seller<sub>name</sub>);
</p>

<p>
#2.add[constraint[symbol]Primary Key(index<sub>col</sub><sub>name</sub>,&#x2026;)
  用于表示在修改表的同时为该表添加主键
</p>

<p>
#3.add unique[index|key][index<sub>name</sub>](index<sub>col</sub><sub>name</sub>,&#x2026;)
  用于表示在修改表的同时为该表添加唯一性索引
</p>

<p>
#4.add[constraint[symbol]] foreign key(col<sub>name</sub>) references tab2(col<sub>name</sub>)
  用于表示在创建新表的同时为该表添加外键
</p>

<p>
*index<sub>col</sub><sub>name</sub>==&gt;column<sub>name</sub>
</p>

<p>
*5.索引的查看(show index)
</p>

<p>
show{index|indexes|keys}
{from|in}tbl<sub>name</sub>[{from|in}db<sub>name</sub>]
[where expr]
</p>

<p>
mysql&gt; show keys from seller;
</p>

<p>
*6.索引的删除
</p>

<p>
#1.drop index index<sub>name</sub> on tbl<sub>name</sub>;
</p>

<p>
mysql&gt; drop index index<sub>cust</sub> on mysql<sub>test.customers</sub>;
</p>

<p>
#2.alter table tbl<sub>name</sub> drop primary key 删主键
</p>

<p>
mysql&gt; alter table mysql<sub>test.customers</sub>
	-&gt; drop primary key,
	-&gt; drop index index<sub>customers</sub>;
</p>

<p>
#2.alter table tbl<sub>name</sub> drop index index<sub>name</sub>  删普通索引
</p>

<p>
#3.alter table tbl<sub>name</sub> drop foreign key 删外键
</p>

<p>
4.数据更新
</p>

<p>
1&gt;插入数据(解答题)(insert)
</p>

<p>
1)插入行完整列值数据(insert..values)
 insert tbl<sub>name</sub>(col<sub>name</sub>,&#x2026;){values}(expr|Default,&#x2026;),(..),
</p>

<p>
mysql&gt; insert mysql<sub>test.customers</sub>
	-&gt; values(901,'zhansan','F','beijing','chaoyang');
</p>

<p>
2)插入行部分列值数据(insert..set)
 insert[into]tbl<sub>name</sub> set col<sub>name</sub>=expr|Default,&#x2026;
</p>

<p>
mysql&gt; insert into mysql<sub>test.customers</sub>
	-&gt; set cust<sub>name</sub>='lisi',cust<sub>address</sub>='wuhai',gender=default;
</p>

<p>
3)插入子查询数据(insert&#x2026;select)
  //选择值赋给对应字段
  insert into tbl<sub>name2</sub>(col<sub>name1</sub>,&#x2026;) select value1,&#x2026;;
  示例:
  insert mysql<sub>test.infos</sub>(user<sub>name,user</sub><sub>city</sub>)select 'LiLi','HeBei';
  //将表1中部分数据复制插入到表2中
  insert into tbl<sub>name2</sub>(a,c,b&#x2026;) select a,c,5&#x2026; from tbl<sub>name1</sub>;
</p>

<p>
2&gt;删除一行或多行数据(解答题)(delete)
  delete from tbl<sub>name</sub>
  where where<sub>condition</sub>
  order by&#x2026; limit row<sub>count</sub>
</p>

<p>
mysql&gt; delete from mysql<sub>test.customers</sub>
	-&gt; where cust<sub>name</sub>='lisi';
</p>

<p>
3&gt;修改数据(解答题)(update)
  update tbl<sub>name</sub>
  set col<sub>name</sub>=expr|Default,col<sub>name2</sub>=expr|Default,&#x2026;.
  where where<sub>condition</sub>
  order by&#x2026; limit row<sub>count</sub>
</p>

<p>
mysql&gt; update mysql<sub>test.customers</sub>
	-&gt; set cust<sub>address</sub>='wuhanshi'
	-&gt; where cust<sub>name</sub>='zhansan';
</p>

<p>
5.数据查询
</p>

<p>
1&gt;select语句
  select select<sub>expr</sub>(要查的值)
		 from table<sub>references</sub> (数据来源),
		 where where<sub>condition</sub>(数据的选择条件)
		 group by col<sub>name</sub>|expr|position(对检索到的记录进行分组)
		 ASC|DESC, with rollup
		 having where<sub>condition</sub> (指定组的选择条件)
		 order by col<sub>name</sub>|expr|position(对查询结果进行排序)
		 asc/desc,&#x2026;
		 limit offset row<sub>count</sub>|row<sub>count</sub> Offset (限制行数)
</p>

<p>
1)列的选择和指定
</p>

<p>
select col<sub>name,col</sub><sub>name2</sub>,&#x2026; from db<sub>name.tbl</sub><sub>name</sub>;(查询某表指定列)
</p>

<p>
select * from db<sub>name.tbl</sub><sub>name</sub>;(查询表中所有列)
</p>

<p>
mysql&gt; select cust<sub>name,cust</sub><sub>address,gender</sub>
	-&gt; from mysql<sub>test.customers</sub>;
</p>

<p>
mysql&gt; select * from mysql<sub>test.customers</sub>;
</p>


<p>
2)定义并使用列的别名
</p>

<p>
col<sub>name</sub> as col<sub>alias</sub> (列的别名)(这个查询的只是虚表,表中真实的col<sub>name没有变</sub>)
</p>

<p>
mysql&gt; select cust<sub>address</sub> as dizhi
	-&gt; from mysql<sub>test.customers</sub>;
</p>

<p>
3)替换查询结果集中的数据(case)
</p>

<p>
case when 条件1 then 表达式1
	   when 条件2 then 表达式2
</p>

<p>
else 表达式
</p>

<p>
end as col<sub>alias</sub>;
</p>

<p>
mysql&gt; select cust<sub>name</sub>,
	-&gt; case
	-&gt; when gender='F'then 'nan'
	-&gt; else 'nv'
	-&gt; end as sex
	-&gt; from mysql<sub>test.customers</sub>;
</p>

<p>
4)计算列值
</p>

<p>
mysql&gt; select cust<sub>id</sub>+199
	-&gt; from mysql<sub>test.customers</sub>;
</p>

<p>
2&gt;聚合函数(系统内置函数)
</p>

<p>
1)count        求组中项数,返回int类型整数
</p>

<p>
2)max   		 求最大值
</p>

<p>
3)min	  		 求最小值
</p>

<p>
4)sum	  	     返回表达式中所有值的和
</p>

<p>
5)avg          求组中值的平均值
</p>

<p>
6)std或stdDev  返回给定表达式中所有值的标准值
</p>

<p>
7)variance	 返回给定表达式中所有值的方差
</p>

<p>
8)group<sub>concat</sub> 返回由属于一组的列值连接组合而成的结果
</p>

<p>
9)bit<sub>and</sub>       逻辑与
</p>

<p>
10)bir<sub>or</sub>    逻辑或
</p>

<p>
11)bit<sub>xor</sub>   逻辑异或
</p>

<p>
*聚合函数经常与group by联合使用;
</p>

<p>
3&gt;from子句与多表连接查询(综合应用)
 1)交叉连接,又称笛卡尔积;
   select * from tab1 cross join tbl2;
   select * from tab1,tab2;
   mysql&gt; select * from tab1,tab2;
</p>

<p>
2)内连接
  tab1 col<sub>name1</sub> 比较运算符 tab2 col<sub>name2</sub>
  select some columns(列名)
  from table1
  inner join (内连接)
  table2
  on some conditions(条件)
</p>

<p>
mysql&gt; select * from student
	-&gt; inner join tbl<sub>score</sub>
	-&gt; on student.studentno=tbl<sub>score.studentno</sub>;
</p>

<p>
内连接分类:
*1.等值连接:使用运算符=(*这个是考点)
*2.非等值连接:使用除=之外的其他比较运算符(&gt;,&lt;,!=)
*3.自连接:将一个表与它自身进行连接
</p>

<p>
内连接含义:(解答题)
 内连接是一种最常用的连接类型,它是通过在查询中设置连接条件的方式,
 来移除查询结果集中某些数据行之后的交叉连接.
</p>

<p>
3)外连接
 *1.左外连接:在from子句中使用关键字left outer join或left join;(以左表为基表)
</p>

<p>
mysql&gt; select * from student left join tbl<sub>score</sub>
	-&gt; on student.studentno=tbl<sub>score.studentno</sub>;  (student是基表)
</p>

<p>
*2.右外连接:在from子句中使用关键字right outer join或right join;(以右表为基表)
</p>

<p>
mysql&gt; select * from student right join tbl<sub>score</sub>
	-&gt; on student.studentno=tbl<sub>score.studentno</sub>;   (tbl<sub>score是基表</sub>)
</p>


<p>
4&gt;where子句与条件查询
</p>

<p>
1)比较运算: 比较两方有null值除&lt;=&gt;这个符号.,其他返回unknown.&lt;=&gt;返回true/false;
</p>

<p>
2)条件查询:
  mysql&gt; select * from mysql<sub>test.customers</sub>
	  -&gt; where gender='F';
</p>

<p>
3)查询范围(between and)
  *1.当查询的过滤条件被限定在值的某个范围时,可以使用关键字"between"
	 expression [NOT] BETWEEN expression1 AND expression2
	 当不使用关键字“NOT”时，值在表达式expression1和expression2之间（包括这两个值）
	 如果使用关键字“NOT”时，其返回值正好相反。&lt;expression1 或 &gt;expression2
</p>

<p>
mysql&gt; select * from mysql<sub>test.customers</sub>
	-&gt; where cust<sub>id</sub> between 900 and 901;
</p>

<p>
*2.使用关键字"in" 可以指定一个值的枚举表,该表中会列出所有可能的值.
  mysql&gt; select * from mysql<sub>test.customers</sub>
	  -&gt; where cust<sub>id</sub> in(900,901,908);
</p>

<p>
4)判定空值
  *is null
   mysql&gt; select cust<sub>name</sub> from mysql<sub>test.customers</sub>
	   -&gt; where cust<sub>contact</sub> is null;
</p>

<p>
5)子查询
  <b>1.根据返回结果分类:(<b><b>*解答题</b></b></b>)
</p>

<p>
#1.表子查询:返回的结果集是一个表。
</p>

<p>
#2.行子查询:返回的结果集是带有一个或多个值的一行数据。
</p>

<p>
#3.列子查询:返回的结果集是一列数据，该列可以有一行或多行，但每行只有一个值。
</p>

<p>
#4.标量子查询:返回的结果集仅仅是一个值。
</p>

<p>
*2.子查询结合关键字"in" 使用的子查询,主要用于判断一个给定的值是否存在于子查询的结果集中.
</p>

<p>
语法: expression(表达式) in subquery(子查询集)
</p>

<p>
mysql&gt; select studentno,student<sub>name</sub>
	-&gt; from student where studentno in    (找到外键,用外键连接两个表)
	-&gt; (select studentno from tbl<sub>score</sub> where score&gt;80); (循环嵌套选择列)
</p>


<p>
取反  (&lt;=80)
mysql&gt; select studentno,student<sub>name</sub>
	-&gt; from student
	-&gt; where studentno not in(select studentno from tbl<sub>score</sub> where score&gt;90);
</p>

<p>
*3.结合比较运算符使用子查询
</p>

<p>
语法:expression{<code>|&lt;=|&gt;|&gt;=|&lt;=&gt;|&lt;&gt;|!</code>}{all|some|any}(subquery)(子查询语句)
</p>

<p>
*:in-&gt; =any-&gt; =some;
mysql&gt; select studentno,student<sub>name</sub>
	-&gt; from student
	-&gt; where studentno =any(select studentno from tbl<sub>score</sub> where score&gt;80);
</p>

<p>
mysql&gt; select studentno,student<sub>name</sub>
	-&gt; from student
	-&gt; where studentno =some(select studentno from tbl<sub>score</sub> where score&gt;80);
</p>

<p>
*:not in-&gt;&lt;&gt;all
mysql&gt; select studentno,student<sub>name</sub>
	-&gt; from student
	-&gt; where studentno &lt;&gt;all(select studentno from tbl<sub>score</sub> where score&gt;90);
</p>

<p>
*:=(精确到条目)
mysql&gt; select studentno,student<sub>name</sub>
	-&gt; from student
	-&gt; where studentno =(select studentno from tbl<sub>score</sub> where score=90);
</p>

<p>
*4.结合关键字"exists"使用的子查询
   语法:exists(subquery)
   mysql&gt; select studentno,student<sub>name</sub>
	   -&gt; from student
	   -&gt; where exists(select studentno from tbl<sub>score</sub> where student.studentno=tbl<sub>score.studentno</sub>);
</p>

<p>
*5.指定查询条件的WHERE子句
</p>

<p>
在指定查询条件的WHERE子句中，可以使用子查询的结果集作为过滤条件的一部分，
并且子查询通常会与关键字“IN”“EXIST”和比较运算符结合使用。
</p>

<p>
#1.结合关键字“IN”使用的子查询：主要用于判定一个给定值是否存在于子查询的结果集中。
</p>

<p>
#2.结合比较运算符使用的子查询：主要用于将表达式的值和子查询的结果进行比较运算。
</p>

<p>
#3.结合关键字“EXISTS”使用的子查询：主要用于判定子查询的结果集是否为空。
</p>

<p>
 5&gt;group by子句与分组数据(综合应用)
1)语法:
  /**
</p>
<ul class="org-ul">
<li>col<sub>name1</sub>   指定聚合函数的条件依据</li>
<li>col<sub>name2</sub>   指定用于分组的选择列</li>
<li>expr        指定用于分组的表达式</li>
<li>position    指定用于分组的列在SELECT语句结果集中的位置，通常是一个正整数</li>
<li>asc|desc    ASC表示升序排列， DESC表示降序。默认ASC</li>
<li>with rollup 可选项，指定在结果集中不仅包含由GROUP BY子句分组后的数据行，</li>
<li>还包含各分组的汇总行，以及所有分组的整体汇总行，可以得到每个分组以及每个分组汇总级别的值</li>
<li>作用:去重复,查找表CT中有多少讲师记录(按姓名分组,排重)</li>
</ul>
<p>
 */
select col<sub>name1,&#x2026;,from</sub> tbl<sub>name</sub>
group by{col<sub>name2</sub>|expr|position}[asc|desc],&#x2026;[with rollup]
</p>

<p>
示例:将表TC按课程和讲师姓名分组,根据讲师姓名获取每位讲师的授课项数;
 mysql&gt; select CName,count(*) as '授课项数'
	 -&gt; from CT group by CName,CTitle;
</p>
<p>
<del>-------</del>---&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">CName</td>
<td class="org-left">授课项数</td>
</tr>
</tbody>
</table>
<p>
<del>-------</del>---&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">
</colgroup>
<tbody>
<tr>
<td class="org-left">小涵</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">爱敏</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">王月</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>
<p>
<del>-------</del>---&#x2013;&#x2014;+
</p>

<p>
示例:将表TC按课程和讲师姓名分组,根据讲师姓名获取每位讲师的授课项数及授课汇总;
mysql&gt; select CTitle,CName,count(*) as '授课项数'
	-&gt; from CT group by CName,CTitle with rollup;//(汇总)(有总字就加这个)
</p>

<p>
<del>----------</del>-------<del>----------</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">CTitle</td>
<td class="org-left">CName</td>
<td class="org-left">授课项数</td>
</tr>
</tbody>
</table>
<p>
<del>----------</del>-------<del>----------</del>
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-right">
</colgroup>
<tbody>
<tr>
<td class="org-left">C++</td>
<td class="org-left">爱敏</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">数据结构</td>
<td class="org-left">爱敏</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">NULL</td>
<td class="org-left">爱敏</td>
<td class="org-right">2</td>
<td class="org-left">&#x2014;&gt;爱敏授课数总计2项</td>
</tr>

<tr>
<td class="org-left">信息系统</td>
<td class="org-left">王月</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">NULL</td>
<td class="org-left">王月</td>
<td class="org-right">1</td>
<td class="org-left">&#x2014;&gt;王月授课数总计1项</td>
</tr>

<tr>
<td class="org-left">数据库</td>
<td class="org-left">小涵</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">NULL</td>
<td class="org-left">小涵</td>
<td class="org-right">1</td>
<td class="org-left">&#x2014;&gt;小涵授课数总计1项</td>
</tr>

<tr>
<td class="org-left">NULL</td>
<td class="org-left">NULL</td>
<td class="org-right">4</td>
<td class="org-left">&#x2014;&gt;全部授课数共计4项</td>
</tr>
</tbody>
</table>
<p>
<del>----------</del>-------<del>----------</del>
</p>

<p>
*简述对于 GROUP BY 子句的使用，需要注意哪些内容？
</p>
</div>
</div>
