org/数据库系统原理笔记.org
** GROUP BY 子句可以包含任意数目的列，使得其可对分组进行嵌套，为数据分组提供更加细致的控制。
** 如果在 GROUP BY 子句中嵌套了分组，那么将按 GROUP BY 子句中列的排列顺序的逆序方式依次进行汇总，
         并将在最后规定的分组上进行一个完全汇总。

** GROUP BY 子句中列出的每个列都必须是检索列或有效的表达式，但不能是聚合函数。

** 除聚合函数之外， SELECT 语句中的每个列都必须在 GROUP BY 子句中给出。

** 如果用于分组的列中含有 NULL 值，则 NULL 将作为一个单独的分组返回；
         如果该列中存在多个 NULL 值，则将这些 NULL 值所在的行分为一组。

	 6>having子句(综合应用)

	  1)having子句 过滤分组;可以包含聚合函数,在数据分组后进行过滤;

	  2)where子句 过滤数据行,不可以包含聚合函数,在数据分组前进行过滤;

	  mysql> select cust_name,cust_address
		  -> from mysql_test.customers
		  -> group by cust_address,cust_name
		  -> having count(*)<=3; (count是计算行数的)
	  HAVING 子句与 WHERE 子句两者之间存在哪些差异？：
** WHERE 子句主要用于过滤数据行，而 HAVING 子句主要用于过滤分组，
        即 HAVING 子句可基于分组的聚合值而不是特定行的值来过滤数据。

** HAVING 子句中的条件可以包含聚合函数，而 WHERE 子句中则不可以。

** WHERE 子句会在数据分组前进行过滤， HAVING 子句则会在数据分组后进行过滤。因而，
        WHERE 子句排除的行不包含在分组中，这就会可能改变计算值，从而影响 HAVING 子句基于
        这些值过滤掉的分组。

	 7>order by子句(指定排序的列)(聚合函数要用(如人数))

		order by col_name|expr|position ASC|DESC

		mysql> select cust_name,gender from mysql_test.customers
			-> order by cust_name desc,cust_address desc;

	 8>limit子句
       /*
        * 使用limit子句限制select语句返回的行数
        * limit row_count: 取row_count行,从第一行开始(起始行的位置0代表第1行)
        * row_count offset:取row_count行,从offset+1行起,
        */
        limit {row_count | row_count offset}

        示例:从表CT的第1行起取2行数据;
        mysql> select CNO,CTitle from CT order by CNO
            -> limit 2 offset 0;(或写成 limit 2,0)

            +-----+----------+
            | CNO | CTitle   |
            +-----+----------+
            |   1 | 数据库    |
            |   2 | 数据结构  |
            +-----+----------+

     9> Order by 和Group by子句的差别汇总
             +---------------+-------------------------------------+
             | Order by子句  |           Group  by子句              |
             +---------------+-------------------------------------+
             | 排序产生的输出 |     分组行,但输出可能不是分组的排序    |
             +---------------+-------------------------------------+
             |任意列都可以使用|     只可能使用选择列或列表达式         |
             +---------------+-------------------------------------+
             | 不一定需要     |若与聚合函数一起使用列或表达式,则必须使用|
             +---------------+-------------------------------------+
	6.视图

	 1>视图概念:

	  1)视图是数据库中的一个对象,它是数据库管理系统提供给用户的以多种角度观察数据库中数据的一种重要机制.

	  2)视图不是数据库中真实的表,而是一张虚拟表,其自身并不存储数据.

	 2>使用视图的优点:

	  1)集中分散数据

	  2)简化查询语句

	  3)重用SQL语句

	  4)保护数据安全

	  5)共享所需数据

	  6)更改数据格式

	 3>创建视图(综合应用)

	  create or replace view_name[(col_list)]
	  as select statement(条件)
	  [with check option] 可选项,指定在可更新视图上必须符合..条件时使用 (不常用)

	  mysql> create or replace view mysql_test.customers_view
		  -> as select * from mysql_test.customers
		  -> where gender='M'
		  -> with check option;

	 4>删除视图(综合应用)

	  drop view[if exists]
	  view_name [,view_name]...
	  [restrict|cascade] 限制条件 可选项

	  mysql> drop view if exists
		  -> mysql_test.coustomers_view;

	 5>修改视图定义(综合应用)

	  alter view view_name[(col_list)]
	  as select statement(条件)
	  [with check option] 可选项,指定在可更新视图上必须符合..条件时使用 (不常用)

	 6>查看视图定义(综合应用)
	  show create view view_name

	 7>更新视图数据(综合应用)

	  1)插入行完整列值数据(insert..values)
	   insert view_name(col_name,...){values}(expr|Default,...),(..),

	   mysql> insert mysql_test.customers_view
		   -> values(901,'zhansan','F','beijing','chaoyang');

	  2)更新表数据(insert..set)
	   update view_name
	   set col_name=expr|Default,col_name2=expr|Default,....
	   where where_condition
	   order by... limit row_count

	   mysql> update mysql_test.customers_view
		   -> set cust_address='wuhanshi'
		   -> where cust_name='zhansan';

	  3)删除视图表数据(delete..from)

		delete from view_name
	    where where_condition
	    order by... limit row_count

	    mysql> delete from mysql_test.customers_view
		    -> where cust_name='lisi';


	 8>查询视图数据(综合应用)

		mysql>select cust_name,cust_address
			-> from mysql_test.customers_view
			-> where cust_id =905;

     9>视图用于查询检索的主要体现
       *1.利用视图简化复杂的表连接
       *2.使用视图重新格式化检索出的数据
       *3.使用视图过滤不想要的数据

* 数据库编程
