public/数据库系统原理笔记.html
<div id="outline-container-org15cfa34" class="outline-3">
<h3 id="org15cfa34">GROUP BY 子句可以包含任意数目的列，使得其可对分组进行嵌套，为数据分组提供更加细致的控制。</h3>
</div>
<div id="outline-container-org5c39cb9" class="outline-3">
<h3 id="org5c39cb9">如果在 GROUP BY 子句中嵌套了分组，那么将按 GROUP BY 子句中列的排列顺序的逆序方式依次进行汇总，</h3>
<div class="outline-text-3" id="text-org5c39cb9">
<p>
并将在最后规定的分组上进行一个完全汇总。
</p>
</div>
</div>

<div id="outline-container-org5a66c92" class="outline-3">
<h3 id="org5a66c92">GROUP BY 子句中列出的每个列都必须是检索列或有效的表达式，但不能是聚合函数。</h3>
</div>

<div id="outline-container-orga474402" class="outline-3">
<h3 id="orga474402">除聚合函数之外， SELECT 语句中的每个列都必须在 GROUP BY 子句中给出。</h3>
</div>

<div id="outline-container-orgc532705" class="outline-3">
<h3 id="orgc532705">如果用于分组的列中含有 NULL 值，则 NULL 将作为一个单独的分组返回；</h3>
<div class="outline-text-3" id="text-orgc532705">
<p>
如果该列中存在多个 NULL 值，则将这些 NULL 值所在的行分为一组。
</p>

<p>
6&gt;having子句(综合应用)
</p>

<p>
1)having子句 过滤分组;可以包含聚合函数,在数据分组后进行过滤;
</p>

<p>
2)where子句 过滤数据行,不可以包含聚合函数,在数据分组前进行过滤;
</p>

<p>
mysql&gt; select cust<sub>name,cust</sub><sub>address</sub>
	-&gt; from mysql<sub>test.customers</sub>
	-&gt; group by cust<sub>address,cust</sub><sub>name</sub>
	-&gt; having count(*)&lt;=3; (count是计算行数的)
HAVING 子句与 WHERE 子句两者之间存在哪些差异？：
</p>
</div>
</div>
<div id="outline-container-orgcb23813" class="outline-3">
<h3 id="orgcb23813">WHERE 子句主要用于过滤数据行，而 HAVING 子句主要用于过滤分组，</h3>
<div class="outline-text-3" id="text-orgcb23813">
<p>
即 HAVING 子句可基于分组的聚合值而不是特定行的值来过滤数据。
</p>
</div>
</div>

<div id="outline-container-org7a8656d" class="outline-3">
<h3 id="org7a8656d">HAVING 子句中的条件可以包含聚合函数，而 WHERE 子句中则不可以。</h3>
</div>

<div id="outline-container-orgb10b1cb" class="outline-3">
<h3 id="orgb10b1cb">WHERE 子句会在数据分组前进行过滤， HAVING 子句则会在数据分组后进行过滤。因而，</h3>
<div class="outline-text-3" id="text-orgb10b1cb">
<p>
WHERE 子句排除的行不包含在分组中，这就会可能改变计算值，从而影响 HAVING 子句基于
这些值过滤掉的分组。
</p>

<p>
7&gt;order by子句(指定排序的列)(聚合函数要用(如人数))
</p>

<p>
order by col<sub>name</sub>|expr|position ASC|DESC
</p>

<p>
mysql&gt; select cust<sub>name,gender</sub> from mysql<sub>test.customers</sub>
	-&gt; order by cust<sub>name</sub> desc,cust<sub>address</sub> desc;
</p>

<p>
8&gt;limit子句
  /*
</p>
<ul class="org-ul">
<li>使用limit子句限制select语句返回的行数</li>
<li>limit row<sub>count</sub>: 取row<sub>count行,从第一行开始</sub>(起始行的位置0代表第1行)</li>
<li>row<sub>count</sub> offset:取row<sub>count行,从offset</sub>+1行起,</li>
</ul>
<p>
*/
limit {row<sub>count</sub> | row<sub>count</sub> offset}
</p>

<p>
示例:从表CT的第1行起取2行数据;
mysql&gt; select CNO,CTitle from CT order by CNO
	-&gt; limit 2 offset 0;(或写成 limit 2,0)
</p>

<p>
<del>-----</del>-----&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">CNO</td>
<td class="org-left">CTitle</td>
</tr>
</tbody>
</table>
<p>
<del>-----</del>-----&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-right">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">数据库</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">数据结构</td>
</tr>
</tbody>
</table>
<p>
<del>-----</del>-----&#x2013;&#x2014;+
</p>

<p>
9&gt; Order by 和Group by子句的差别汇总
</p>
<p>
<del>---------------</del>--------------------------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Order by子句</td>
<td class="org-left">Group  by子句</td>
</tr>
</tbody>
</table>
<p>
<del>---------------</del>--------------------------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">排序产生的输出</td>
<td class="org-left">分组行,但输出可能不是分组的排序</td>
</tr>
</tbody>
</table>
<p>
<del>---------------</del>--------------------------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">任意列都可以使用</td>
<td class="org-left">只可能使用选择列或列表达式</td>
</tr>
</tbody>
</table>
<p>
<del>---------------</del>--------------------------------&#x2013;&#x2014;+
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">不一定需要</td>
<td class="org-left">若与聚合函数一起使用列或表达式,则必须使用</td>
</tr>
</tbody>
</table>
<p>
		 <del>---------------</del>--------------------------------&#x2013;&#x2014;+
6.视图
</p>

<p>
1&gt;视图概念:
</p>

<p>
1)视图是数据库中的一个对象,它是数据库管理系统提供给用户的以多种角度观察数据库中数据的一种重要机制.
</p>

<p>
2)视图不是数据库中真实的表,而是一张虚拟表,其自身并不存储数据.
</p>

<p>
2&gt;使用视图的优点:
</p>

<p>
1)集中分散数据
</p>

<p>
2)简化查询语句
</p>

<p>
3)重用SQL语句
</p>

<p>
4)保护数据安全
</p>

<p>
5)共享所需数据
</p>

<p>
6)更改数据格式
</p>

<p>
3&gt;创建视图(综合应用)
</p>

<p>
create or replace view<sub>name</sub>[(col<sub>list</sub>)]
as select statement(条件)
[with check option] 可选项,指定在可更新视图上必须符合..条件时使用 (不常用)
</p>

<p>
mysql&gt; create or replace view mysql<sub>test.customers</sub><sub>view</sub>
	-&gt; as select * from mysql<sub>test.customers</sub>
	-&gt; where gender='M'
	-&gt; with check option;
</p>

<p>
4&gt;删除视图(综合应用)
</p>

<p>
drop view[if exists]
view<sub>name</sub> [,view<sub>name</sub>]&#x2026;
[restrict|cascade] 限制条件 可选项
</p>

<p>
mysql&gt; drop view if exists
	-&gt; mysql<sub>test.coustomers</sub><sub>view</sub>;
</p>

<p>
5&gt;修改视图定义(综合应用)
</p>

<p>
alter view view<sub>name</sub>[(col<sub>list</sub>)]
as select statement(条件)
[with check option] 可选项,指定在可更新视图上必须符合..条件时使用 (不常用)
</p>

<p>
6&gt;查看视图定义(综合应用)
 show create view view<sub>name</sub>
</p>

<p>
7&gt;更新视图数据(综合应用)
</p>

<p>
1)插入行完整列值数据(insert..values)
 insert view<sub>name</sub>(col<sub>name</sub>,&#x2026;){values}(expr|Default,&#x2026;),(..),
</p>

<p>
mysql&gt; insert mysql<sub>test.customers</sub><sub>view</sub>
	-&gt; values(901,'zhansan','F','beijing','chaoyang');
</p>

<p>
2)更新表数据(insert..set)
 update view<sub>name</sub>
 set col<sub>name</sub>=expr|Default,col<sub>name2</sub>=expr|Default,&#x2026;.
 where where<sub>condition</sub>
 order by&#x2026; limit row<sub>count</sub>
</p>

<p>
mysql&gt; update mysql<sub>test.customers</sub><sub>view</sub>
	-&gt; set cust<sub>address</sub>='wuhanshi'
	-&gt; where cust<sub>name</sub>='zhansan';
</p>

<p>
3)删除视图表数据(delete..from)
</p>

<p>
delete from view<sub>name</sub>
where where<sub>condition</sub>
order by&#x2026; limit row<sub>count</sub>
</p>

<p>
mysql&gt; delete from mysql<sub>test.customers</sub><sub>view</sub>
	-&gt; where cust<sub>name</sub>='lisi';
</p>


<p>
8&gt;查询视图数据(综合应用)
</p>

<p>
mysql&gt;select cust<sub>name,cust</sub><sub>address</sub>
	-&gt; from mysql<sub>test.customers</sub><sub>view</sub>
	-&gt; where cust<sub>id</sub> =905;
</p>

<p>
9&gt;视图用于查询检索的主要体现
  *1.利用视图简化复杂的表连接
  *2.使用视图重新格式化检索出的数据
  *3.使用视图过滤不想要的数据
</p>
</div>
</div>
</div>
