org/数据库系统原理笔记.org
** 存储过程

	 1>存储过程的基本概念(填空)

	   1)存储过程是一组为了完成某项特定功能的SQL语句集,
	     其实质就是一段存储在数据库中的代码.
		 它可以由声明式的sql语句和过程式的sql语句组成.

		  *1.声明式的sql语句:create,update,select;

		  *2.过程式的sql语句:case if else

		2)优点

		 *1.可增强SQL语言的功能和灵活性;

		 *2.良好的封装性;

		 *3.高能性;

		 *4.可减少网络流量;

		 *5.可作为一种安全机制来确保数据的安全性和数据的完整性;

	 2>创建存储过程(解答题)

	  1)delimiter命令(分隔符)

	    delimiter$$-->用户自己定义结束符(替换";"告诉系统语集中的";",并不是结束)
		   mysql> delimiter $$  (使用$$替换成$$)
		   mysql> show databases;
			   -> $$

	  2)使用create procedure语句创建存储过程;

		create procedure sp_name (在默认数据库中创建)
		([proc_parameter[,...]]) (指定存储过程的参数结果)
		routine_body (存储过程的主体部分,也称存储过程体)

		[in|out|inout]param_name type(设置参数)

		mysql> use mysql_test;(指定默认数据库)
		Database changed
		mysql> delimiter $$(设定结束符)
		mysql> create procedure sp_update_sex (in cid int,csex char(1))
			-> begin (语句集开始)
			-> update coustomers set gender=csex where cust_id=cid;(根据id号修改性别)
			-> end $$ (语句集结束)

	 3>存储过程体(选择填空)

	  1)使用declare语句声明局部变量

		declare var_name[,...] type [default value] (名字,类型及默认值)

		->begin
		  declare cid int(10);(存储过程的开头处声明,作用范围仅限于begin..end内)
		->end

	  2)使用set语句为局部变量赋值

		set var_name=expr[,var_name=expr]
		set cid=910;

	  3)使用select..into语句把选定列的值直接存储到局部变量中

		select col_name[,...](指定列名)
		into var_name[,...](指定要赋值的变量名)
		table_expr	(表示select语句中的from子句及后面的语法部分)

		*.存储过程体中的SELECT…INTO语句返回的结果集只能有一行数据。

	  4)流程控制语句

	   *1.条件判断语句
	    if...then...else语句--> if 条件 then 表达式1 else 表达式2

		case语句--> case 条件1 when 条件 then

	   *2.循环语句

	    while语句--> while 条件 表达式(累加/减) end while

		repeat语句--> repeat 表达式   end repeat

		loop语句--> loop 表达式  end loop

		iterate语句--> 用于表示退出当前循环,进行下一次循环(同continue)


	  5)使用declare cursor语句---声明游标

	   declare cursor_name  (指定要创建的游标名称)
	   cursor for select_statement

	  6)使用open语句--------------打开游标
	    open cursor_name (指定要打开的游标)

	  7)使用fetch...into语句------读取数据
		fetch cursor_name (读取被指定的已打开的游标)
		into var_name[,var_name]...(指定存放数据的变量名)

	  8)使用close-----------------关闭游标
	    close cursor_name

      简述在 MySQL 中使用游标的过程(解答题)
      #1.声明游标：用 DECLARE CURSOR 语句创建游标;
      #2.打开游标：用 OPEN 语句打开游标;
      #3.读取数据：用 FETCH...INTO 语句从中读取数据。
         FETCH 语句是将游标指向的一行数据赋给一些变量，
         这些变量的数目必须等于声明游标时 SELECT 子句中选择列的数目。
         游标相当于一个指针，它指向当前的一行数据;
      #4.关闭游标：用 CLOSE 语句关闭游标;

	 4>调用存储过程(解答题)

	   使用call语句调用存储过程
	   call sp_name([palameter[,...]]) (指定被调用的存储过程的名称及当下要用的参数)
	   call sp_name[()]

	   call sp_update_sex(909,'M');

	 5>删除存储过程(选择填空)
	   使用drop procedure语句删除存储过程

	   drop procedure [if exists] sp_name;
** 存储函数

	 1>存储函数的基本概念(填空选择)

	   存储函数与存储过程一样,是由SQL语句和过程式语句的代码片段.

	   1)简述存储函数和存储过程的区别

	    *1.存储函数不能输出参数,这是因为存储函数自身就是输出参数;存储过程可以拥有输出参数
	    *2.存储函数可以直接调用,不需要call语句,存储过程的调用需要call语句进行
	    *3.存储函数必须包含一条return语句,存储过程不允许有return语句

	 2>创建存储函数(解答题)
		create function sp_name([func_parameter[,...]]) (指定存储函数的参数)
		returns type  (声明存储函数返回值的数据类型,type指定返回值的数据类型)
		routine_body (指定函数的主体部分)

		param_name type

		mysql> use mysql_test

		Database changed
		mysql> delimiter $$
		mysql> create function fn_search(cid int)
			-> returns char(20)
			-> deterministic
			-> begin
			-> declare sex char(20);
			-> select gender into sex from customers
			-> where cust_id=cid;
			-> if sex is null then
			-> return(select'meiyou');
			-> else if sex='F' then
			-> return(select 'nvhai');
			-> end if
			-> ;
			-> end if;
			-> end $$

	 3>调用存储函数(填空选择)
	  select sp_name([func_parameter[,...]])

	  select fn_search(903)


	 4>删除存储函数(填空选择)

	   drop function[if exists] sp_name;

* 数据库安全与保护
** 数据库完整性

	 1>数据库完整性(选择填空)
	  数据库完整性是指数据库中数据的正确性和相容性.

	 2>完整性约束条件作用对象(选择填空)
	   1)列级约束:对列的类型,取值范围,精度等的约束
	   2)元组约束:元组(行)中各个字段之间的相互约束
	   3)表级约束:若干元组(行),关系(表)之间的联系的约束;

	 3>定义与实现完整性约束(解答题)

	   1)实体完整性约束
	     在mysql,实体完整性是通过主键约束和后选键约束实现的

		 主键列必须遵守的规则
		  *1.每一个表只能定义一个主键;
		  *2.主键的值(键值)必须能够唯一标志表中的每一行记录,且不能为NULL;
		  *3.复合主键不能包含不必要的多余列;
		  *4.一个列名在复合主键的列表中只能出现一次;

	   2)参照完整性约束
		 references tbl_name(指定外键所参照的表名)
		 (index_col_name,...)(指定外键名)
		 [on delete reference_option(restrict|cascade|set null|no action)]
		 [on update restrict|cascade|set null|no action](指定实现完整性约束的策略)

		 reference_option:(限制语句包括以下几种)
		 *1.restrict :限制策略(限制删除和更新主键或外键)
		 *2.cascade  :级联策略(将被参照表的外键删除)
		 *3.set null :置空策略(将参照表的主键设为空,被参照表才能删除外键)
		 *4.no action:不采取实施策略(不允许操作)

		 mysql> use mysql_test       (指定数据库mysql_test)
				Database changed
		 mysql> create table orders  (创建表orders)
			 -> (					 (以下指定orders表中的各属性列)
			 -> order_id int not null auto_increment,
			 -> order_product char(50) not null,
			 -> order_product_type char(50) not null,
			 -> cust_id int not null,
			 -> order_date datetime not null,
			 -> order_price double not null,
			 -> order_amount int not null,
			 -> primary key(order_id),       (给orders表设置主键)
			 -> foreign key(cust_id)		 (给orders表设置外键)
			 -> references customers(cust_id)(开始参照完整性约束,指定参照表)
			 -> on delete restrict			 (不允许删除外键)
			 -> on update restrict			 (不允许更换外键)
			 -> );

			*unique key index_name 候选键

	     简述在指定外键时，需要遵守的规则(解答题)
         *1.被参照表必须已经用一条 CREATE TABLE 语句创建了，或者必须是当前正在创建的表。
            如若是后一种情形，则被参照表与参照表是同一个表，这样的表称为自参照表，
            这种结构称为自参照完整性。

         *2.必须为被参照表定义主键。

         *3.必须在被参照表的表名后面指定列名或列名的组合。这个列或列组合必须是这个被参照表的主键或候选键。

         *4.尽管主键是不能够包含空值的，但允许在外键出现一个空值。这意味着，
            只要外键的每个非空值出现在指定的主键中，这个外键的内容就是正确的。

         *5.外键中的列的数目必须和被参照表的主键中的列的数目相同。

         *6.外键中的列的数据类型必须和被参照表的主键中的对应列的数据类型相同。

	   3)用户完整性约束

	     *1.not null:非空约束

		 *2.check :检查约束

		 *3.触发器

	   4)命名完整性约束(选择填空)
	     语法格式是：constraint[symbol]指定的约束名字

		 其中，语法项“symbol”是指定的约束名字，
		 这个名字是在完整性约束说明的前面被定义，其在数据库里必须是唯一的。
		 倘若没有明确给出约束的名字，则MySQL自动创建一个约束名字。需要注意的是，
		 只能给基于表的完整性约束指定名字，而无法给基于列的完整性约束指定名字。
		 因此，基于表的完整性约束比基于列的完整性约束更受欢迎.

		 *1.只能给基于表的完整性约束指定名字
		 *2.无法给基于列的完整性约束指定名字

	   5)更新完整性约束(解答填空)
	     使用alter table语句更新与列或表有关的各种约束.

		 *1.完整性约束不能直接被修改.(先删除,再增加)

		 *2.使用alter table语句,可以独立地删除完整性约束,而不会删除表本身.
		    (drop table语句删除一个表,则表中所有的完整性约束都会被自动删除);
