public/数据库系统原理笔记.html

<div id="outline-container-org51c13de" class="outline-2">
<h2 id="org51c13de">数据库编程</h2>
<div class="outline-text-2" id="text-org51c13de">
</div>
<div id="outline-container-org23bc90c" class="outline-3">
<h3 id="org23bc90c">存储过程</h3>
<div class="outline-text-3" id="text-org23bc90c">
<p>
1&gt;存储过程的基本概念(填空)
</p>

<p>
1)存储过程是一组为了完成某项特定功能的SQL语句集,
  其实质就是一段存储在数据库中的代码.
  它可以由声明式的sql语句和过程式的sql语句组成.
</p>

<p>
*1.声明式的sql语句:create,update,select;
</p>

<p>
*2.过程式的sql语句:case if else
</p>

<p>
2)优点
</p>

<p>
*1.可增强SQL语言的功能和灵活性;
</p>

<p>
*2.良好的封装性;
</p>

<p>
*3.高能性;
</p>

<p>
*4.可减少网络流量;
</p>

<p>
*5.可作为一种安全机制来确保数据的安全性和数据的完整性;
</p>

<p>
2&gt;创建存储过程(解答题)
</p>

<p>
1)delimiter命令(分隔符)
</p>

<p>
delimiter\[-->用户自己定义结束符(替换";"告诉系统语集中的";",并不是结束)
		   mysql> delimiter \]  (使用\[替换成\])
   mysql&gt; show databases;
	   -&gt; $$
</p>

<p>
2)使用create procedure语句创建存储过程;
</p>

<p>
create procedure sp<sub>name</sub> (在默认数据库中创建)
([proc<sub>parameter</sub>[,&#x2026;]]) (指定存储过程的参数结果)
routine<sub>body</sub> (存储过程的主体部分,也称存储过程体)
</p>

<p>
[in|out|inout]param<sub>name</sub> type(设置参数)
</p>

<p>
mysql&gt; use mysql<sub>test</sub>;(指定默认数据库)
Database changed
mysql&gt; delimiter \[(设定结束符)
		mysql> create procedure sp_update_sex (in cid int,csex char(1))
			-> begin (语句集开始)
			-> update coustomers set gender=csex where cust_id=cid;(根据id号修改性别)
			-> end \] (语句集结束)
</p>

<p>
3&gt;存储过程体(选择填空)
</p>

<p>
1)使用declare语句声明局部变量
</p>

<p>
declare var<sub>name</sub>[,&#x2026;] type [default value] (名字,类型及默认值)
</p>

<p>
-&gt;begin
  declare cid int(10);(存储过程的开头处声明,作用范围仅限于begin..end内)
-&gt;end
</p>

<p>
2)使用set语句为局部变量赋值
</p>

<p>
set var<sub>name</sub>=expr[,var<sub>name</sub>=expr]
set cid=910;
</p>

<p>
3)使用select..into语句把选定列的值直接存储到局部变量中
</p>

<p>
select col<sub>name</sub>[,&#x2026;](指定列名)
into var<sub>name</sub>[,&#x2026;](指定要赋值的变量名)
table<sub>expr</sub> (表示select语句中的from子句及后面的语法部分)
</p>

<p>
*.存储过程体中的SELECT…INTO语句返回的结果集只能有一行数据。
</p>

<p>
4)流程控制语句
</p>

<p>
*1.条件判断语句
 if&#x2026;then&#x2026;else语句&#x2013;&gt; if 条件 then 表达式1 else 表达式2
</p>

<p>
case语句&#x2013;&gt; case 条件1 when 条件 then
</p>

<p>
*2.循环语句
</p>

<p>
while语句&#x2013;&gt; while 条件 表达式(累加/减) end while
</p>

<p>
repeat语句&#x2013;&gt; repeat 表达式   end repeat
</p>

<p>
loop语句&#x2013;&gt; loop 表达式  end loop
</p>

<p>
iterate语句&#x2013;&gt; 用于表示退出当前循环,进行下一次循环(同continue)
</p>


<p>
5)使用declare cursor语句&#x2014;声明游标
</p>

<p>
declare cursor<sub>name</sub>  (指定要创建的游标名称)
cursor for select<sub>statement</sub>
</p>

<p>
6)使用open语句---------&#x2013;&#x2014;打开游标
  open cursor<sub>name</sub> (指定要打开的游标)
</p>

<p>
7)使用fetch&#x2026;into语句-&#x2013;&#x2014;读取数据
  fetch cursor<sub>name</sub> (读取被指定的已打开的游标)
  into var<sub>name</sub>[,var<sub>name</sub>]&#x2026;(指定存放数据的变量名)
</p>

<p>
8)使用close------------&#x2013;&#x2014;关闭游标
  close cursor<sub>name</sub>
</p>

<p>
简述在 MySQL 中使用游标的过程(解答题)
#1.声明游标：用 DECLARE CURSOR 语句创建游标;
#2.打开游标：用 OPEN 语句打开游标;
#3.读取数据：用 FETCH&#x2026;INTO 语句从中读取数据。
   FETCH 语句是将游标指向的一行数据赋给一些变量，
   这些变量的数目必须等于声明游标时 SELECT 子句中选择列的数目。
   游标相当于一个指针，它指向当前的一行数据;
#4.关闭游标：用 CLOSE 语句关闭游标;
</p>

<p>
4&gt;调用存储过程(解答题)
</p>

<p>
使用call语句调用存储过程
call sp<sub>name</sub>([palameter[,&#x2026;]]) (指定被调用的存储过程的名称及当下要用的参数)
call sp<sub>name</sub>[()]
</p>

<p>
call sp<sub>update</sub><sub>sex</sub>(909,'M');
</p>

<p>
5&gt;删除存储过程(选择填空)
  使用drop procedure语句删除存储过程
</p>

<p>
drop procedure [if exists] sp<sub>name</sub>;
</p>
</div>
</div>
<div id="outline-container-org0213f5b" class="outline-3">
<h3 id="org0213f5b">存储函数</h3>
<div class="outline-text-3" id="text-org0213f5b">
<p>
1&gt;存储函数的基本概念(填空选择)
</p>

<p>
存储函数与存储过程一样,是由SQL语句和过程式语句的代码片段.
</p>

<p>
1)简述存储函数和存储过程的区别
</p>

<p>
*1.存储函数不能输出参数,这是因为存储函数自身就是输出参数;存储过程可以拥有输出参数
*2.存储函数可以直接调用,不需要call语句,存储过程的调用需要call语句进行
*3.存储函数必须包含一条return语句,存储过程不允许有return语句
</p>

<p>
2&gt;创建存储函数(解答题)
   create function sp<sub>name</sub>([func<sub>parameter</sub>[,&#x2026;]]) (指定存储函数的参数)
   returns type  (声明存储函数返回值的数据类型,type指定返回值的数据类型)
   routine<sub>body</sub> (指定函数的主体部分)
</p>

<p>
param<sub>name</sub> type
</p>

<p>
mysql&gt; use mysql<sub>test</sub>
</p>

<p>
Database changed
mysql&gt; delimiter \[
		mysql> create function fn_search(cid int)
			-> returns char(20)
			-> deterministic
			-> begin
			-> declare sex char(20);
			-> select gender into sex from customers
			-> where cust_id=cid;
			-> if sex is null then
			-> return(select'meiyou');
			-> else if sex='F' then
			-> return(select 'nvhai');
			-> end if
			-> ;
			-> end if;
			-> end \]
</p>

<p>
3&gt;调用存储函数(填空选择)
 select sp<sub>name</sub>([func<sub>parameter</sub>[,&#x2026;]])
</p>

<p>
select fn<sub>search</sub>(903)
</p>


<p>
4&gt;删除存储函数(填空选择)
</p>

<p>
drop function[if exists] sp<sub>name</sub>;
</p>
</div>
</div>
</div>

<div id="outline-container-org15fd411" class="outline-2">
<h2 id="org15fd411">数据库安全与保护</h2>
<div class="outline-text-2" id="text-org15fd411">
</div>
<div id="outline-container-org2d787d8" class="outline-3">
<h3 id="org2d787d8">数据库完整性</h3>
<div class="outline-text-3" id="text-org2d787d8">
<p>
1&gt;数据库完整性(选择填空)
 数据库完整性是指数据库中数据的正确性和相容性.
</p>

<p>
2&gt;完整性约束条件作用对象(选择填空)
  1)列级约束:对列的类型,取值范围,精度等的约束
  2)元组约束:元组(行)中各个字段之间的相互约束
  3)表级约束:若干元组(行),关系(表)之间的联系的约束;
</p>

<p>
3&gt;定义与实现完整性约束(解答题)
</p>

<p>
1)实体完整性约束
  在mysql,实体完整性是通过主键约束和后选键约束实现的
</p>

<p>
主键列必须遵守的规则
 *1.每一个表只能定义一个主键;
 *2.主键的值(键值)必须能够唯一标志表中的每一行记录,且不能为NULL;
 *3.复合主键不能包含不必要的多余列;
 *4.一个列名在复合主键的列表中只能出现一次;
</p>

<p>
2)参照完整性约束
  references tbl<sub>name</sub>(指定外键所参照的表名)
  (index<sub>col</sub><sub>name</sub>,&#x2026;)(指定外键名)
  [on delete reference<sub>option</sub>(restrict|cascade|set null|no action)]
  [on update restrict|cascade|set null|no action](指定实现完整性约束的策略)
</p>

<p>
reference<sub>option</sub>:(限制语句包括以下几种)
*1.restrict :限制策略(限制删除和更新主键或外键)
*2.cascade  :级联策略(将被参照表的外键删除)
*3.set null :置空策略(将参照表的主键设为空,被参照表才能删除外键)
*4.no action:不采取实施策略(不允许操作)
</p>

<p>
mysql&gt; use mysql<sub>test</sub>       (指定数据库mysql<sub>test</sub>)
	   Database changed
mysql&gt; create table orders  (创建表orders)
	-&gt; (					 (以下指定orders表中的各属性列)
	-&gt; order<sub>id</sub> int not null auto<sub>increment</sub>,
	-&gt; order<sub>product</sub> char(50) not null,
	-&gt; order<sub>product</sub><sub>type</sub> char(50) not null,
	-&gt; cust<sub>id</sub> int not null,
	-&gt; order<sub>date</sub> datetime not null,
	-&gt; order<sub>price</sub> double not null,
	-&gt; order<sub>amount</sub> int not null,
	-&gt; primary key(order<sub>id</sub>),       (给orders表设置主键)
	-&gt; foreign key(cust<sub>id</sub>)		 (给orders表设置外键)
	-&gt; references customers(cust<sub>id</sub>)(开始参照完整性约束,指定参照表)
	-&gt; on delete restrict			 (不允许删除外键)
	-&gt; on update restrict			 (不允许更换外键)
	-&gt; );
</p>

<p>
*unique key index<sub>name</sub> 候选键
</p>

<p>
简述在指定外键时，需要遵守的规则(解答题)
*1.被参照表必须已经用一条 CREATE TABLE 语句创建了，或者必须是当前正在创建的表。
   如若是后一种情形，则被参照表与参照表是同一个表，这样的表称为自参照表，
   这种结构称为自参照完整性。
</p>

<p>
*2.必须为被参照表定义主键。
</p>

<p>
*3.必须在被参照表的表名后面指定列名或列名的组合。这个列或列组合必须是这个被参照表的主键或候选键。
</p>

<p>
*4.尽管主键是不能够包含空值的，但允许在外键出现一个空值。这意味着，
   只要外键的每个非空值出现在指定的主键中，这个外键的内容就是正确的。
</p>

<p>
*5.外键中的列的数目必须和被参照表的主键中的列的数目相同。
</p>

<p>
*6.外键中的列的数据类型必须和被参照表的主键中的对应列的数据类型相同。
</p>

<p>
3)用户完整性约束
</p>

<p>
*1.not null:非空约束
</p>

<p>
*2.check :检查约束
</p>

<p>
*3.触发器
</p>

<p>
4)命名完整性约束(选择填空)
  语法格式是：constraint[symbol]指定的约束名字
</p>

<p>
其中，语法项“symbol”是指定的约束名字，
这个名字是在完整性约束说明的前面被定义，其在数据库里必须是唯一的。
倘若没有明确给出约束的名字，则MySQL自动创建一个约束名字。需要注意的是，
只能给基于表的完整性约束指定名字，而无法给基于列的完整性约束指定名字。
因此，基于表的完整性约束比基于列的完整性约束更受欢迎.
</p>

<p>
*1.只能给基于表的完整性约束指定名字
*2.无法给基于列的完整性约束指定名字
</p>

<p>
5)更新完整性约束(解答填空)
  使用alter table语句更新与列或表有关的各种约束.
</p>

<p>
*1.完整性约束不能直接被修改.(先删除,再增加)
</p>

<p>
*2.使用alter table语句,可以独立地删除完整性约束,而不会删除表本身.
   (drop table语句删除一个表,则表中所有的完整性约束都会被自动删除);
</p>
</div>
</div>
