org/数据库系统原理笔记.org
** 触发器
	  1>创建触发器

		1)概念:是用户定义在关系表上的一类由事件驱动的数据库对象,
		  也是一种保证数据完整性的方法,任何对表的修改操作均为数据库服务器 自动激活 相应的触发器,
		  触发器与表的关系十分密切,其主要作用是实现主键和外键不能保证的复杂的参照完整性和数据的一致性，
		  从而有效地保护表中的数据;(例:更新被参照表,参照表就会自动更新)

	    2)使用create trigger语句创建触发器

		  create trigger
		  trigger_name  (指定触发器名字)
		  trigger_time  (指定触发时间)
		  trigger_event (指定触发事件)
		  on table_name (指定触发对象(触发器相关的表名))
		  for each row  (指定对于受触发事件影响的每一行都要激活触发器的动作)
		  trigger_body; (指定触发器动作的主体)

		  mysql> create trigger customers_insert_trigger
			  -> after insert
			  -> on mysql_test.customers for each row
			  -> set @str='one customer added!';

		  select @str


	  2>使用触发器(解答实操)

	   1)insert 触发器
	     在insert触发器代码内,可引用一个名为new的虚表,来访问被插入的行
		 在before insert触发器中,new中的值可以被更新;

		 例:在mysql_test的表customers中重新创建触发器customers_insert_trigger,
		    用于每次向表customers插入一行数据时,将用户变量str的值设为新插入客户的id号;

		 mysql> create trigger mysql_test.customers_insert_trigger
			-> after insert on mysql_test.customers for each row
			-> set @str=new.cust_id;

         INSERT触发器可在INSERT语句执行之前或之后执行,使用该触发器时,需要注意以下几点:
         *1.在INSERT触发器代码内，可引用一个名为NEW（不区分大小写）的虚拟表，来访问被插入的行。
         *2.在BEFORE INSERT触发器中，NEW中的值也可以被更新，即允许更改被插入的值。
         *3.对于AUTO_INCREMENT列，NEW在INSERT执行之前包含的是0值，在INSERT执行之后将包含新的自动生成值。

	   2)delete 触发器

		 在delete触发器代码内,可引用一个名为old的虚表,来访问被删除的行

		 mysql> create trigger mysql_test.customers_insert_trigger
			 -> after delete on mysql_test.customers for each row
			 -> set @str=old.cust_id;

	   3)update 触发器
	     在update触发器代码内,可以引用old的虚表来访问执行前的值,也可以用new虚表来访问更新后的值;

		 注:UPDATE触发器可在UPDATE语句执行之前或之后执行。
		    使用该触发器时，需要注意：当触发器涉及对触发表自身的更新操作时，
			只能使用BEFORE UPDATE触发器，而AFTER UPDATE触发器将不被允许。

		  mysql> create trigger mysql_test.customers_update_trigger
			 -> before update on mysql_test.customers for each row
			 -> set new.cust_address=old.cust_contact;

	  3>使用drop语句删除触发器
	    drop trigger[if exists]
		database_name.trigger_name);(指定触发器所在数据库和触发器的名称

		mysql> drop trigger if exists mysql_test.customers_insert_trigger;
** 安全性与访问控制

	 1>用户账号管理(选择填空)

	   1)root用户:
	     mysql> select user from mysql.user;

	   2)使用create user语句来创建一个或多个 MySQL 账户，并设置相应的口令

	     CREATE USER user[identified by [PASSWORD]'password'] (可选项,指定用户账号对应口令通过密码识别)

         *语法格式介绍如下：
         *1."user"指定创建用户账号,其格式为'user_name'@'host_name'其中user_name表示用户名
            host_name表示主机名,及用户连接MySql时所在的主机的名字,如果在创建的过程中,
            只给出账户中的用户名,而没有指定主机名,则主机名会默认为'%',其表示一组主机.

         *2."identified by子句"是可选项,用于指定用户账号对应的口令,若该用户账号无口令,则可省略;

         *3.关键字 "PASSWORD"是可选项,用于指定散列口令,及若使用明文设置口令时,可忽略password关键字;

         *4.语法项 password指定用户账号的口令,其在identified by或PASSWORD关键字之后,
            设定的口令值可以是只有字母和数字组成的明文,也可以是通过PASSWORD()函数得到的散列值;

		3)使用select password(num) 获取散列值
		  mysql> select password(456);


		4)使用drop user 'user_name'@'host name'删除用户
		  mysql> drop user zhangsan@NorthStar;

	    例:在Mysql服务器中添加两个新用户,其用户名分别为zhangsan和lisi,
	       他们的主机名为localhost(这个操作时必须是真实主机名),
		   用户zhangsan的口令为123,用户lisi的口令为对明文456
		   使用password()函数加密返回的散列值;

		   mysql> select password(456);(获取456的散列值)
		   mysql> create user 'zhangsan'@'NorthStar' identified by '123',
			   -> 'lisi'@'NorthStar'identified by password
			   -> '*531E182E2F72080AB0740FE2F2D689DBE0146E04';

	    5)使用rename user语句修改一个或多个已经存在的用户账号。
		  rename user old_user (已存在的名字)
		  to new_user (修改后的名字)
		  [,old_user to new_user]...

		  mysql> rename user 'zhangsan'@'NorthStar' to 'wangwu'@'NorthStar';

		6)使用set password 语句修改用户登录口令
		  update set password for 'user_name'@'localhost'
		  =password('new_password')|'encrypted password'

		  mysql> set password for 'wangwu'@'NorthStar'=password('123');

	    *1.MySQL的用户账号及相关信息都存储在一个名为mysql的MySQL数据库中,
		   这个数据库里有一个名为user的数据表,包含了所有用户账号.
		   并且它用一个名为user的列存储用户的登录名。

		*2.mysql安装时，设置用户名为“root”，作为一个新安装的系统，当前只有一个名为root的用户。
		   这个用户是在成功安装MySQL服务器后，由系统创建的，并且被赋予了操作和管理MySQL的所有权限。
		   因此，root用户拥有对整个MySQL服务器完全控制的能力。

	 2>账号权限管理(选择填空)
	   1)使用grant语句为用户授权(grant...to)

		 grant priv_type(用于指定权限名称)
		 [column_list](用于指定授权表中具体的列)
		 [,priv_type[col_list]]
		 on[object_type] priv_level(指定类别及级别)
		 to user_specification[,user-specification](用于设定用户口令与密码[1])
		 [with grant option] (实现权限的转移和限制)(可以授权给别人)

	     [1]user[identified by [password]'password']

		 mysql> grant select(cust_id,cust_name)  --列级授权
		  	 -> on mysql_test.customers
			 -> to 'wangwu'@'NorthStar';

	   2)在grant语句中使用with子句实现权限转移(grant...to(授权用户)...with(授权转移)

	     例:授予当前系统中一个不存在的用户zhou在数据库mysql_test表customers上拥有select和update的权限,
		    并允许其可以将自身的这个权限授予其他用户;

		 mysql> grant select,update				 --表级权限
			 -> on mysql_test.customers
			 -> to'zhou''NorthStar'identified by '123'
			 -> with grant option;


		 mysql> grant all						 --数据库级别权限
		 	 -> on mysql_test.*
			 -> to'wangwu'@'NorthStar';

		例:授予系统中已存在的wangwu拥有创建用户的权限


	  3)在此语法格式中:语法项“priv_level”:用于指定权限的级别，其可以授予的权限有这样几个：
	    列权限、表权限、数据库权限和用户权限。

		*1.授予表权限时，可授予的权限有：
		   SELECT、INSERT、DELETE、UPDATE、REFERENCES、CREATE、ALTER、INDEX、DROP、ALL。
		*2.授予列权限时,只可授予SELECT、INSERT和UPDATE这三种权限,同时权限的后面要加上列名column_list。
		*3.授予数据库权限时，可授予的权限除了可以指定为授予表权限时的所有值之外，还可以是下面这些值:
		   REATE TEMPORARY TABLES、CREATE VIEW、SHOW VIEW、CREATE ROUTINE、
		   ALTER ROUTINE、EXECUTE ROUTINE、LOOK TABLES。

		*4.最有 效率 的权限是 用户权限 ,授予用户权限时,除了可以指定为授予数据库权限时的所有值之外
		   还可以是下面这些值：CREATE USER、SHOW DATABASES。


		mysql> grant create user
			-> on *.*
		    -> to 'wangwu'@'NorthStar';

	  3)使用revoke语句撤销用户权限
        *使用Revoke语句必须拥有mysql数据库的全局 create user权限或 update 权限;
		revoke priv_type(用于指定要收回权限名称)
		 [column_list](用于指定要收回权限列)
		 [,priv_type[col_list]]
		 on[object_type] priv_level(指定要收回权限类别及级别)
		 from user_specification[,user-specification](用于设定被收回权限的用户)

		 mysql> revoke select
			 -> on mysql_test.customers
			 -> from 'wangwu'@'NorthStar';


