public/数据库系统原理笔记.html
<div id="outline-container-org98114a8" class="outline-3">
<h3 id="org98114a8">触发器</h3>
<div class="outline-text-3" id="text-org98114a8">
<p>
1&gt;创建触发器
</p>

<p>
1)概念:是用户定义在关系表上的一类由事件驱动的数据库对象,
  也是一种保证数据完整性的方法,任何对表的修改操作均为数据库服务器 自动激活 相应的触发器,
  触发器与表的关系十分密切,其主要作用是实现主键和外键不能保证的复杂的参照完整性和数据的一致性，
  从而有效地保护表中的数据;(例:更新被参照表,参照表就会自动更新)
</p>

<p>
2)使用create trigger语句创建触发器
</p>

<p>
create trigger
trigger<sub>name</sub>  (指定触发器名字)
trigger<sub>time</sub>  (指定触发时间)
trigger<sub>event</sub> (指定触发事件)
on table<sub>name</sub> (指定触发对象(触发器相关的表名))
for each row  (指定对于受触发事件影响的每一行都要激活触发器的动作)
trigger<sub>body</sub>; (指定触发器动作的主体)
</p>

<p>
mysql&gt; create trigger customers<sub>insert</sub><sub>trigger</sub>
	-&gt; after insert
	-&gt; on mysql<sub>test.customers</sub> for each row
	-&gt; set @str='one customer added!';
</p>

<p>
select @str
</p>


<p>
2&gt;使用触发器(解答实操)
</p>

<p>
1)insert 触发器
  在insert触发器代码内,可引用一个名为new的虚表,来访问被插入的行
  在before insert触发器中,new中的值可以被更新;
</p>

<p>
例:在mysql<sub>test的表customers中重新创建触发器customers</sub><sub>insert</sub><sub>trigger</sub>,
   用于每次向表customers插入一行数据时,将用户变量str的值设为新插入客户的id号;
</p>

<p>
mysql&gt; create trigger mysql<sub>test.customers</sub><sub>insert</sub><sub>trigger</sub>
   -&gt; after insert on mysql<sub>test.customers</sub> for each row
   -&gt; set @str=new.cust<sub>id</sub>;
</p>

<p>
INSERT触发器可在INSERT语句执行之前或之后执行,使用该触发器时,需要注意以下几点:
*1.在INSERT触发器代码内，可引用一个名为NEW（不区分大小写）的虚拟表，来访问被插入的行。
*2.在BEFORE INSERT触发器中，NEW中的值也可以被更新，即允许更改被插入的值。
*3.对于AUTO<sub>INCREMENT列</sub>，NEW在INSERT执行之前包含的是0值，在INSERT执行之后将包含新的自动生成值。
</p>

<p>
2)delete 触发器
</p>

<p>
在delete触发器代码内,可引用一个名为old的虚表,来访问被删除的行
</p>

<p>
mysql&gt; create trigger mysql<sub>test.customers</sub><sub>insert</sub><sub>trigger</sub>
	-&gt; after delete on mysql<sub>test.customers</sub> for each row
	-&gt; set @str=old.cust<sub>id</sub>;
</p>

<p>
3)update 触发器
  在update触发器代码内,可以引用old的虚表来访问执行前的值,也可以用new虚表来访问更新后的值;
</p>

<p>
注:UPDATE触发器可在UPDATE语句执行之前或之后执行。
   使用该触发器时，需要注意：当触发器涉及对触发表自身的更新操作时，
   只能使用BEFORE UPDATE触发器，而AFTER UPDATE触发器将不被允许。
</p>

<p>
mysql&gt; create trigger mysql<sub>test.customers</sub><sub>update</sub><sub>trigger</sub>
   -&gt; before update on mysql<sub>test.customers</sub> for each row
   -&gt; set new.cust<sub>address</sub>=old.cust<sub>contact</sub>;
</p>

<p>
3&gt;使用drop语句删除触发器
  drop trigger[if exists]
  database<sub>name.trigger</sub><sub>name</sub>);(指定触发器所在数据库和触发器的名称
</p>

<p>
mysql&gt; drop trigger if exists mysql<sub>test.customers</sub><sub>insert</sub><sub>trigger</sub>;
</p>
</div>
</div>
<div id="outline-container-org0480c29" class="outline-3">
<h3 id="org0480c29">安全性与访问控制</h3>
<div class="outline-text-3" id="text-org0480c29">
<p>
1&gt;用户账号管理(选择填空)
</p>

<p>
1)root用户:
  mysql&gt; select user from mysql.user;
</p>

<p>
2)使用create user语句来创建一个或多个 MySQL 账户，并设置相应的口令
</p>

<p>
CREATE USER user[identified by [PASSWORD]'password'] (可选项,指定用户账号对应口令通过密码识别)
</p>

<p>
*语法格式介绍如下：
*1."user"指定创建用户账号,其格式为'user<sub>name</sub>'@'host<sub>name</sub>'其中user<sub>name表示用户名</sub>
   host<sub>name表示主机名,及用户连接MySql时所在的主机的名字,如果在创建的过程中</sub>,
   只给出账户中的用户名,而没有指定主机名,则主机名会默认为'%',其表示一组主机.
</p>

<p>
*2."identified by子句"是可选项,用于指定用户账号对应的口令,若该用户账号无口令,则可省略;
</p>

<p>
*3.关键字 "PASSWORD"是可选项,用于指定散列口令,及若使用明文设置口令时,可忽略password关键字;
</p>

<p>
*4.语法项 password指定用户账号的口令,其在identified by或PASSWORD关键字之后,
   设定的口令值可以是只有字母和数字组成的明文,也可以是通过PASSWORD()函数得到的散列值;
</p>

<p>
3)使用select password(num) 获取散列值
  mysql&gt; select password(456);
</p>


<p>
4)使用drop user 'user<sub>name</sub>'@'host name'删除用户
  mysql&gt; drop user zhangsan@NorthStar;
</p>

<p>
例:在Mysql服务器中添加两个新用户,其用户名分别为zhangsan和lisi,
   他们的主机名为localhost(这个操作时必须是真实主机名),
   用户zhangsan的口令为123,用户lisi的口令为对明文456
   使用password()函数加密返回的散列值;
</p>

<p>
mysql&gt; select password(456);(获取456的散列值)
mysql&gt; create user 'zhangsan'@'NorthStar' identified by '123',
	-&gt; 'lisi'@'NorthStar'identified by password
	-&gt; '*531E182E2F72080AB0740FE2F2D689DBE0146E04';
</p>

<p>
5)使用rename user语句修改一个或多个已经存在的用户账号。
  rename user old<sub>user</sub> (已存在的名字)
  to new<sub>user</sub> (修改后的名字)
  [,old<sub>user</sub> to new<sub>user</sub>]&#x2026;
</p>

<p>
mysql&gt; rename user 'zhangsan'@'NorthStar' to 'wangwu'@'NorthStar';
</p>

<p>
6)使用set password 语句修改用户登录口令
  update set password for 'user<sub>name</sub>'@'localhost'
  =password('new<sub>password</sub>')|'encrypted password'
</p>

<p>
mysql&gt; set password for 'wangwu'@'NorthStar'=password('123');
</p>

<p>
*1.MySQL的用户账号及相关信息都存储在一个名为mysql的MySQL数据库中,
   这个数据库里有一个名为user的数据表,包含了所有用户账号.
   并且它用一个名为user的列存储用户的登录名。
</p>

<p>
*2.mysql安装时，设置用户名为“root”，作为一个新安装的系统，当前只有一个名为root的用户。
   这个用户是在成功安装MySQL服务器后，由系统创建的，并且被赋予了操作和管理MySQL的所有权限。
   因此，root用户拥有对整个MySQL服务器完全控制的能力。
</p>

<p>
2&gt;账号权限管理(选择填空)
  1)使用grant语句为用户授权(grant&#x2026;to)
</p>

<p>
grant priv<sub>type</sub>(用于指定权限名称)
[column<sub>list</sub>](用于指定授权表中具体的列)
[,priv<sub>type</sub>[col<sub>list</sub>]]
on[object<sub>type</sub>] priv<sub>level</sub>(指定类别及级别)
to user<sub>specification</sub>[,user-specification](用于设定用户口令与密码[1])
[with grant option] (实现权限的转移和限制)(可以授权给别人)
</p>

<p>
[1]user[identified by [password]'password']
</p>

<p>
mysql&gt; grant select(cust<sub>id,cust</sub><sub>name</sub>)  &#x2013;列级授权
	  -&gt; on mysql<sub>test.customers</sub>
	-&gt; to 'wangwu'@'NorthStar';
</p>

<p>
2)在grant语句中使用with子句实现权限转移(grant&#x2026;to(授权用户)&#x2026;with(授权转移)
</p>

<p>
例:授予当前系统中一个不存在的用户zhou在数据库mysql<sub>test表customers上拥有select和update的权限</sub>,
   并允许其可以将自身的这个权限授予其他用户;
</p>

<p>
mysql&gt; grant select,update				 &#x2013;表级权限
	-&gt; on mysql<sub>test.customers</sub>
	-&gt; to'zhou''NorthStar'identified by '123'
	-&gt; with grant option;
</p>


<p>
mysql&gt; grant all						 &#x2013;数据库级别权限
	 -&gt; on mysql<sub>test</sub>.*
	-&gt; to'wangwu'@'NorthStar';
</p>

<p>
例:授予系统中已存在的wangwu拥有创建用户的权限
</p>


<p>
3)在此语法格式中:语法项“priv<sub>level</sub>”:用于指定权限的级别，其可以授予的权限有这样几个：
  列权限、表权限、数据库权限和用户权限。
</p>

<p>
*1.授予表权限时，可授予的权限有：
   SELECT、INSERT、DELETE、UPDATE、REFERENCES、CREATE、ALTER、INDEX、DROP、ALL。
*2.授予列权限时,只可授予SELECT、INSERT和UPDATE这三种权限,同时权限的后面要加上列名column<sub>list</sub>。
*3.授予数据库权限时，可授予的权限除了可以指定为授予表权限时的所有值之外，还可以是下面这些值:
   REATE TEMPORARY TABLES、CREATE VIEW、SHOW VIEW、CREATE ROUTINE、
   ALTER ROUTINE、EXECUTE ROUTINE、LOOK TABLES。
</p>

<p>
*4.最有 效率 的权限是 用户权限 ,授予用户权限时,除了可以指定为授予数据库权限时的所有值之外
   还可以是下面这些值：CREATE USER、SHOW DATABASES。
</p>


<p>
mysql&gt; grant create user
	-&gt; on <b>.</b>
	-&gt; to 'wangwu'@'NorthStar';
</p>

<p>
3)使用revoke语句撤销用户权限
  *使用Revoke语句必须拥有mysql数据库的全局 create user权限或 update 权限;
  revoke priv<sub>type</sub>(用于指定要收回权限名称)
   [column<sub>list</sub>](用于指定要收回权限列)
   [,priv<sub>type</sub>[col<sub>list</sub>]]
   on[object<sub>type</sub>] priv<sub>level</sub>(指定要收回权限类别及级别)
   from user<sub>specification</sub>[,user-specification](用于设定被收回权限的用户)
</p>

<p>
mysql&gt; revoke select
	-&gt; on mysql<sub>test.customers</sub>
	-&gt; from 'wangwu'@'NorthStar';
</p>
</div>
</div>
