org/数据库系统原理笔记.org
** 事物与并发处理
	 1>事务的概念
	    事务是用户定义的一个数据操作序列,这些操作可作为一个完整的工作单元,
		要么全部执行,要么全部不执行,是一个不可分割的工作单位.
		事务中的操作一般是对数据的更新操作,包括增,删,改.

		程序(静止)-执行->事务(动态);

		*.用户显示定义事务的语句

		以begin transaction语句开始;

		以commit(提交)语句或rollback(回滚)语句结束;

	 2>事务的特征(ACID)(解答题)

	   1)原子性：事务的原子性保证事务包含的一组更新操作是原子不可分的,
	             即事务是不可分割的最小工作单位，所包含的这些操作是一个整体;(原子不可分)

	   2)一致性:要求事务必须满足数据库的完整性约束,且事务执行完毕后将数据库由一个一致性状态
	            转变到另一个一致性状态。其中，数据库的一致性状态是一种以一致性规则为基础的逻辑属性。

	   3)隔离性:隔离性要求事物是彼此独立的,隔离的,即一个事务的执行不能被其他事务所打扰.
	            一个事务对数据库变更的结果必须在commit后,另一个事务才能存取.

	   4)持续性:持续性也称为永久性，是指一个事务一旦提交，它对数据库中数据的改变就应该是永久性的，
	            且接下来的其他操作或故障不应该对其执行结果有任何影响。

	 3>并发操作问题

	   1)丢失更新问题
	     事务T2的提交结果会破坏T1提交的结果;

	   2)不可重复读
	    *1.事务T1读取某一数据后,事务T2对其做了修改,当事务T1再次读该数据时,得到与前一次不同的值。

		*2.事务T1按一定条件从数据库中读取了某些数据记录后,事务T2删除了其中部分记录，
		   当事务T1再次按相同条件读取数据时，发现某些记录神秘地消失了。

		*3.事务T1按一定条件从数据库中读取某些数据记录后，事务T2插入了一些记录，
		   当事务T1再次按相同条件读取数据时，发现多了一些记录。

	   3)读"脏"数据
	     *.设有两个事务T1和T2,读"脏数据"是指,事务T1修改某一数据,并将其写回磁盘,
		   事务T2读取同一数据后,事务T1由于某种原因被撤销,这时事务T1已经修改过的数据恢复原值,
		   事务T2读取到的数据就与数据库中的数据不一致,则事务T2读到的数据就为"脏数据",
		   即不正确的数据,所以在DB技术中,"脏数据"是指已提交随后又被撤销的数据;

	   4)并发控制(***解答题***)
	    DBMS必须对并发操作提供一定的控制,以防止它们彼此干扰,从而保证数据库的正确性不被破坏,
	    避免数据库的不一致性,这种机制就称为"并发控制"

	  4>封锁

	   *含义:
	   一个锁实质上就是允许或阻止一个事务对一个数据对象的存取特权

	   事物需要封锁时,事物通过向系统请求对它所希望的数据对象加锁,以确保它不被非预期改变.

	   1)排他锁(X锁),用于写操作;(阻止其他事务进行写操作)

	   2)共享锁(S锁),用于读操作;(所有事务都可以读)

	   我们通常以粒度来描述封锁的数据单元的大小

	   数据单元越大,粒度越小,,并发性就越高,软件的复杂性和系统开销也就越大;

	   3)在多个用户同时使用 MySQL 数据库的情况下，为了得到一个一致的备份，
	     需要在指定的表上使用 LOCK TABLES table_name READ 语句做一个读锁定,
		 以防止在备份过程中表被其他用户更新；

		 而当恢复数据时，则需要使用 LOCK TABLES table_name WRITE语句做一个写锁定，
		 以避免发生数据冲突.在数据库备份或恢复完毕之后需要使用 UNLOCK TABLES 语句
		 对该表进行解锁。


	   3)封锁的级别(隔离度)

	    0级封锁:不重写其他非0级封锁事务的未提交的更新的数据(实用价值低)

		1级封锁:不允许重写未提交的更新数据,防止了丢失更新的发生;

		2级封锁:既不重写也不读未提交的更新数据(防止了读脏数据);

		3级封锁:不读未提交的更新数据,不写任何(包括读操作)未提交数据;


	   4)封锁引起的问题(死锁和活锁)(***解答题***)

	     封锁带来的一个重要问题是可能引起"活锁"和"死锁"

	     在并发事物处理过程中,由于锁会使一事物处于等待状态而调度其他事物处理,因而该事物可能会因优先级低而永远
	     等待下去,这种现象称为"活锁",活锁问题的解决与调度算法有关每一种最简单的办法就是"先来先服务",(优先级问题)

	     两个以上事物循环等待被同组中另一事物锁住的数据单元的情形,称为"死锁"(一个用户A 访问表A(锁住了表A),
	     然后又访问表B；另一个用户B 访问表B(锁住了表B)，然后企图访问表A；这时用户A由于用户B已经锁住表B，
	     它必须等待用户B释放表B才能继续，同样用户B要等用户A释放表A才能继续，这就死锁就产生了.)(互访,但互不释放锁)

	     活锁--先来先服务

		 死锁--预防

		  *1.一次性锁请求;

		  *2.锁请求排序;

		  *3.序列化处理;

	      *4.资源剥夺;

	   5)造成数据库运行事务异常中断的因素
	     *1.计算机硬件故障
	     *2.计算机软件故障
	     *3.病毒
	     *4.人为无操作
	     *5.自然灾害
	     *6.盗窃

      6)客串行性
        在数据库系统中,可串行性就是并发执行的正确性准则,即当且仅当一组事物的并发执行调度是可串行的,
        才认为是正确的;

	  7)简述封锁的工作原理(解答题)
        *1.若事务 T 对数据 D 加了 X 锁，则所有别的事务对数据 D 的锁请求都必须等待直到事务 T 释放锁。
        *2.若事务 T 对数据 D 加了 S 锁，则别的事务还可对数据 D 请求 S 锁，
          而对数据 D 的 X锁请求必须等待直到事务 T 释放锁。
        *3.事务执行数据库操作时都要先请求相应的锁，即对读请求 S 锁，对更新请求 X 锁。
          这个过程一般是由 DBMS 在执行操作时自动隐含地进行。
        *4.事务一直占有获得的锁直到结束时释放。

      7)两段封锁法(Tow-Phase Locking,2PL)
        封锁时一种并发控制技术,而可串行是并发控制的正确性标准,其中两段封锁法(2PL)
        是一种最简单而有效的保障封锁其调度是可串行性的方法;

	 5>备份与恢复

	    1)数据备份是指通过导出数据或者复制表文件的方式来制作数据库的复本;

		2)数据库恢复则是当数据库主线故障或遭到破坏时,将备份的数据库加载到系统,
		  从而使数据库从错误状态恢复到备份时的正确状态.

		  数据库的恢复是以备份为基础的,它是与备份相对应的系统维护和管理操作;

		3)使用select into...outFile语句备份数据(拷出)
		  select * into outFile 'file_name' (文件名称)
		  export_options  (配置文件表达式[1])
		  | into dumpfile 'file_name'
		  [1]
		  [field (决定数据行在备份文件中存储的格式)
				[terminated by 'string']  (指定字段间分隔符)
				[optionally enclosed by 'char']  (指定包裹文件中字符值的符号)
				[escaped by 'char']]  (指定转义字符)

		  [lines terminated by 'string']  (指定数据行结束的标志)

		  *.表备份
		  mysql> select * from mysql_test.customers
			  -> into outfile 'E/:BACKUP/backupfile.txt'
			  -> fields terminated by ','
			  -> optionally enclosed by ""
			  -> lines terminated by'?';

		 4)使用load data...infile语句恢复数据
		   *1.将备份导入空表中
            LOAD DATA INFILE ‘file_name.txt’ //指定待导入的数据库备份文件名,文件中保持了待载入数据库的所有数据行;
            INTO TABLE tb1_name       //指定需要导入的表名.
            [FIELDS                   //用于判断字段之间和数据行之间的分割符合;
            [TERMINATED BY ’string’]
            [OPTIONALLY] ENCLOSED BY ’char’]
            [ESCAPED BY ’char’]
            ]
            [LINES
            [STARTING BY ’string’]  //指定一个前缀,导入数据行时,忽略数据行中的该前缀和前缀之间的内容,
                                      如果某行不包括该前缀,则整个数据行被跳过;
            [TERMINATED BY ’string’] //指定一行结束的标志
            ]

		  示例:将备份导入空表中
	      mysql> load data infile 'E/:BACKUP/backupfile.txt'
			  -> into table mysql_test.customers_copy
			  -> fields terminated by ','
			  -> optionally enclosed by ""
			  -> lines terminated by'?';

* 数据库应用设计与开发实例(高校在线选课系统)
** 需求描述与分析(选择填空)
   1>功能性需求:分功能模块(管理员后台模块  学生使用模块  教师使用模块)
   2>非功能需求:在线:B-S:web服务器,浏览器/服务器结构,网卡 wamp(windows(系统) Apache(web服务器) MySQL,PHP)
   3>质量要求:
	   1)可靠性
	   2)正确性
	   3)兼容性
	   4)健壮性(容错性)

** 系统设计(解答实操)

   1>功能模块设计
	  1)登录验证模块

   2>概念设计
	  1)确认实体(局部设计)
		 *1.学生
		 *2.教师
		 *3.课程
		 *4.院系
		 *5.系统管理员
		 *6.管理学生
		 *7.管理教师
		 *8.管理课程
		 *9.管理院系

	  2)将实体转换成E-R图(整体设计)

	       *1.学生(学号,姓名,性别,密码)
		   *2.教师(教师工号,姓名,性别,年龄,职称,密码)
		   *3.课程(课程号,课程名,学分,时间,地点,类别,开课学院,限选人数)
		   *4.院系(院系名称,办公地点,教师人数)
		   *5.系统管理员(姓名,ID号,密码)

	     *.在数据库设计时，实体的描述信息可根据实际需求进行增加或删减，如果实体的属性较多，
		   在构建E-R模型时不一定需要把所有的属性都标识在E-R模型上，可以另外用文字说明，
		   这样也使得E-R模型简明清晰，便于分析。

		 3)联系(1:N和N:M)
		  *1.学生--课程  (选修(N:M))
		  *2.教师--课程  (授课(1:N))
		  *3.教师--院系  (属于(N:1))
		  *4.学生--院系	 (属于(N:1))
		  *5.系统管理员--学生 (管理(M:N))
		  *6.系统管理员--教师 (管理(M:N))
		  *7.系统管理员--课程 (管理(M:N))
		  *8.系统管理员--院系 (管理(M:N))


   3>逻辑结构设计

	     1)逻辑结构设计的任务是把在概念结构设计产生的概念模型转换为具体的DBMS所支持的逻辑数据模型,
	       也就是导出特定的DBMS可以处理的数据库逻辑结构;(***解答题***)

		 2)将E-R图变为关系表

		  *1.学生(学号,性别,姓名,密码,院系编号)
		  *2.教师(工号,性别,姓名,年龄,职称,密码,院系编号)
		  *3.课程(课程号,课程名,学分,地点,类别,时间,开课学院,限选人数,工号)
		  *4.院系(院系编号,系名,学生人数,教师人数)
		  *5.系统管理员(id号,姓名,密码)
		  *6.管理学生(管理员id,学号,操作时间)(中间表(M:N))
		  *7.管理教师(管理员id,学号,操作时间)(中间表(M:N))
		  *8.管理课程(管理员id,课程号,操作时间)(中间表(M:N))
		  *9.管理院系(管理员id,院系编号,操作时间)(中间表(M:N))

   4>规范化设计
		   1:N关系 在多的(N)表中添加1的表中的主键作为N关系表的外键

		   N:M关系 :建立一个中间表,以两表之间的联系为实体,
		            将两边表中的主码作为该表的主键同联系的属性一起作为该表的属性;

	  5>物理结构设计

		1)使用SQL语言创建数据库
		  mysql> create database db_xuanke;

		2)创建关系表,创建(索引)主键.外键

		  增删改查:
		  删改:数据项的用update和delete  表/数据库/视图/索引:alter和drop
		  增查:create和select

		3)设置完整性约束
** 系统实现(解答实操)

	  1>实现数据库行为
	    1)安全控制(限制权限)

		2)数据库保护(触发器trigger)

		3)事物与并发控制(事务配合锁)

		4)数据查询与统计报表(视图)

	  2>应用软件的业务逻辑

	    1)设计可视化页面 html/css实现系统登录验证页面

		2)WAMP--使用PHP编程相应的服务端代码,完成登录验证页面与后台数据库的操作交互
** 系统测试与维护(选择填空)

	  1>登录验证测试

	  2>管理员后台主要功能测试

	  3>各模块测试;
* 数据库管理技术的发展
