org/数据库系统原理笔记.org
** 数据库技术发展阶段概述(选择填空)
	  1>人工管理阶段

	  2>文件系统阶段

	  3>数据库系统阶段
		1)第一代数据库系统
		  *1.层次模型数据库管理系统
		  *2.网状模型数据库管理系统(*1是*2的特例)
		  *核心和基础:数据模型;
		          ╭ #1.支持三级模式(外模式,模式,内模式)的体系结构
		          | #2.用存取路径来表示数据之间的联系
		  共同特点<
                  | #3.独立的数据定义语言
                  ╰ #4.导航的数据操纵语言;
		2)第二代数据库系统
		  关系数据库系统
		  *核心和基础:关系模型

		 优点:
		  *1.模型简单清晰
		  *2.理论基础好
		  *3.数据独立性强
		  *4.数据库语言非过程化
		  *5.标准化

		3)第三代数据库系统的特征(OODBS)
		  *1.应支持数据管理,对象管理和知识管理;
		  *2.必须保持或继承第二代数据库系统的技术;
		  *3.必须对其他系统开放;

	    * NoSQL系统支持的数据存储模型。
          *1.键值（Key-Value）存储。常见的键值存储数据库包括Tokyo Cabinet/Tyrant、Redis和Oracle BDB等。
          *2.文档存储。常见的文件型数据库有CouchDB、MongoDB等。
          *3.列存储。常见的列存储数据库有Cassandra、HBase等。
          *4.图存储。图存储数据库是基于图理论构建的，使用结点、属性和边的概念。

        *图灵奖获得者:c.w.Bachman (巴赫曼), E.F.Codd(科德), james Gray(格雷);
** 数据库仓库与数据挖掘

	  1>数据仓库及其特征

	    1)与传统的数据库技术的区别:

		  传统的数据库:操作型处理服务(联机事务处理),数据仓库:分析型处理服务(联机分析处理);

		2)数据仓库(Data Warehouse, DW)是面向主题的,集成的,稳定的,随时间变化的数据集合,
		  用于支持管理决策的过程;(***解答题***)

		  *数据仓库不是可以买到的产品,而是一种面向分析的数据存储方案;

		3)数据仓库特征:
		  *1.面向主题
		  *2.集成性
		  *3.数据的非易失性
		  *4.数据的时变性;

	  2>数据仓库的三个概念

	    1)粒度
		  *是指数据仓库的数据单位中保存数据的细化或综合程度的级别,数据细化的越高,
		   粒度就越小,反之,细化程度越低,粒度级就越大;

		2)分割(切片)

		3)维(度):是人们观察数据的特定角度,是考虑问题时一类属性,此类属性的集合构成了一个维度,例如时间维等;


	 3>数据挖掘

	   1)从大量的,不完全的,有噪声的,模糊的,随机的实际应用数据中发现并提取隐藏在其中的
	     人们事先不知道的,但又是潜在有用信息和知识的一种技术,又称为知识发现;

	   2)功能(***解答题***)

	     *1.概念描述
		 *2.关联分析
		 *3.分类与预测
		 *4.聚类
		 *5.孤立点测试
		 *6.趋势和演变分析

	   3)简述在实际使用中,数据挖掘的过程(***解答题***)

	     *1.确定业务对象
	     *2.数据的选择
	     *3.数据的预处理
	     *4.建模
	     *5.模型评估
	     *6.模型部署
** 大数据管理技术
	  1>大数据及其特征(2008年提出)
		1)大数据是指无法在可容忍的时间内用现有信息技术和软,硬件工具符其进行感知,
		  获取,管理,处理的服务的数据集合;

		2)特征
		 *1.数据量大,即大量化
		 *2.数据种类繁多,即多样化
		 *3.处理速度快,即快速化
		 *4.价值密度低

		3)大数据管理技术的典型代表:
		  1>分布式文件系统;
		  2>key/value非关系数据模型
		  3>MapReduce并行编程模型为代表的众多新技术和新系统;
		    MapReduce技术是Google公司于2004年提出的大规模并行计算解决方案，
		    主要应用于大规模廉价集群上的大数据并行处理。MapReduce以Key/Value的分布式存储系统为基础，
		    通过元数据集中存储、数据以chunk为单位分布存储和数据chunk冗余复制来保证其高可用性。


数据库系统原理PHP部分
** 通过PHP编程语言编写相应的服务端代码,完成前台页面与后台数据的交互操作,
   具体建立与MYSQL数据库服务器的链接.

** PHP内置了许多函数,通过使用内置函数 mysql,PHP程序可以很好地与MYSQL数据库进行交互.

** PHP操作MYSQL数据库的基本步骤如下:
   1>首先建立与MYSQL数据库服务器的连接;
   2>然后要对其进行操作的数据库;
   3>再执行相应的数据库操作,包括对数据的添加,删除,修改和查询等
   4>最后关闭与MYSQL数据库服务器的连接

** 建立数据库连接的方法(mysql()函数的用法)
   //localhost:3306表示连接本地主机中的MYSQL数据库服务器
   mysql_php程序名("localhost:3306","用户名","密码");

   示例:
   编写一个数据库服务器的连接示例程序connect.php,要求以超级用户root及其密码123456
   连接本地主机的MYSQL数据库服务器,并使用$con保存连接的结果,其过程如下:
   connect.php //文件名,用文本编辑器打开编辑

   <?php //php程序时被包含在标记符<?php  ?>之间的代码
     /**
      * php 连接数据库三要素：数据库服务器ip地址、数据库用户名、数据库密码。
      * mysql_connect();连接数据库,返回布尔值,
      * $conn:true:连接成功,false连接失败
      */
     $conn=mysql_connect("localhost:3306","root","123456");//定义变量以$开头
     if(!$conn){
        echo"连接失败!<br>"; //echo语句返回信息
        echo"错误编号: "mysql_errno()"!<br>"; //<br>为换行标记符
        echo"错误信息:"mysql_err()"<br>"; //echo语句返回信息
        die(); //终止程序运行
     }
        echo"连接成功!<br>";
   ?>

